[["Steak Chapala.", 4, "pos"], ["The food was fresh and delicious The salsa was my mother's favorite We loved this restaurant Friendly staff Quick service.", 2, "neg"], ["We came here hungry and it underwhelmed The salsa was bland and something tasted off about it.", 4, "pos"], ["Fair Tex-Mex, Unfriendly Service, Unattractive Setting I've eaten a lot of Tex-Mex food and really like it.", 2, "neg"], ["Good food at great prices I love Dos Reales Have had three children attend the University of Illinois so I have been here several times.", 2, "neg"], ["Have eaten here several times and have always had a good experience.", 4, "pos"], ["Great service The food is solid, but overpriced.", 3, "neg"], ["I got the wild boar entree and my experience was okay.", 3, "neg"], ["This is a great brew house Loved the beer and the food is very tasty  Fresh ingredients and wonderful menu.", 3, "neg"], ["Pretentious attitude, extremely slow service!!! Waited 5 minutes for a server, then 7 minutes longer for our beverages.", 3, "neg"], ["Best BBQ I've ever had They have delicious burnt ends only served at a certain period during the day because they sell out so fast.", 5, "pos"], ["Great bbq in an unexpected place The burnt ends where the best I have ever had The twice baked potato casserole was excellent.", 5, "pos"], ["This place is too big for its britches.", 2, "neg"], ["When you come here, you know you are going to wait I am fine waiting What I am not fine with is rude customer service.", 3, "neg"], ["Certainly better than any famous daves but quite overrated Especially for the wait.", 4, "pos"], ["Family rated it a 4, I personally thought 35 Above standard buffet with plentiful sushi options made this a winner.", 4, "pos"], ["Went for dinner and left satisfied  The staff was friendly and attentive, and the menu was large and had a ton of great sushi rolls.", 4, "pos"], ["Always a Wonderful Experience Kofusion is the perfect place to sit outdoors and have a leisurely dinner with friends.", 2, "neg"], ["Worst experience If I could have choose zero stars I would have.", 4, "pos"], ["As much as how the name might sounds this is not an asian friendly place.", 3, "neg"], ["Crane Alley Friday Night It was pretty sweet I enjoyed the sweet potato fries Dined outside under colorful lights.", 3, "neg"], ["I ordered a rare burger and got it.", 3, "neg"], ["I love the sweet potato fries and the relaxed atmosphere.", 3, "neg"], ["Decent options for all.", 4, "pos"], ["Great, GREAT hang out Are there more extensive beer lists in CU? Possibly Can the prices be beat? I doubt it.", 4, "pos"], ["Amazing service and great food And it's got great music Mexican music too Totally worth the money you spend.", 5, "pos"], ["Eggcellent breakfast fare! Good service, fresh and generous portions.", 4, "pos"], ["CRAZY GOOD! Grew up eating great Mexican food in Arizona and Colorado and a number of trips to Mexico.", 4, "pos"], ["Kind of an unexpected location for a restaurant, but don't let that turn you away.", 2, "neg"], ["Best bar in Champaign Lots of people complain about the prices but it is not your typical pub.", 5, "pos"], ["Seven Saints is a very pleasant experience overall I arrived on whiskey Wednesday when Irish whiskeys were half off.", 5, "pos"], ["Amazing! We stopped for lunch on a Friday afternoon Great all the way! The pretzels were the best and we try pretzels everywhere we go.", 3, "neg"], ["Just ok We came with the family and ordered multiple sliders and pretzels.", 2, "neg"], ["Yumm-O!.", 2, "neg"], ["Great ambience, superb tapas variety of drinks including wine and beer But the best service by William.", 4, "pos"], ["Look this restaurant up and decided to go based off of the menu that they have up on the site.", 1, "neg"], ["Fantastic! We ordered 6 tapas and the Mixed Paella We wil go back next time we are in town.", 4, "pos"], ["Love this restaurant! They have a great Tapas menu if you just want to come in for some drinks and snack, but their dinner menu is awesome t", 5, "pos"], ["Won't be going back.", 4, "pos"], ["Lunch isn't served till noon on weekends.", 1, "neg"], ["Go to courier cafe for a quiet rendezvous with history.", 4, "pos"], ["Not sure what people ordered who didn't give a good review Reuben was amazing Service was highly friendly.", 2, "neg"], ["It's our favorite First things firstsalad bar, salad bar, salad bar.", 5, "pos"], ["First Time - Great Food!!! Ate here for the first time this past weekend (lunch).", 2, "neg"], ["So do not order the meatloaf My dad being a picky eater thought this would be a safe choice Not at all.", 1, "neg"], ["Unhappy.", 2, "neg"], ["10 stars I'm confused with the low scores people have given.", 3, "neg"], ["This evening was the first time I came to this restaurant and I was dining alone.", 3, "neg"], ["The Sunday brunch was fantastic Lots of options , even for vegetarians Lil pricey but worth the money.", 4, "pos"], ["I got the spinnaker which was delicious, and my GF got 2 eggs and an order of potatoes this is what she got it was very sparse compared to t", 1, "neg"], ["TERRIBLE PLACE FOR A FAMILY WITH CHILDREN!  We went there for a family brunch with our children.", 1, "neg"], ["Management was very rude, not worth it", 2, "neg"], ["Excellent and fast service Surely something on the menu for everyone in your party Next time in the area I am sure to be back again.", 4, "pos"], ["Tasty Always busy, so expect a wait It's worth it though They have the 2nd best pancakes i've ever had in my life.", 4, "pos"], ["Apple Dumplin' is not sweet.", 3, "neg"], ["Need baby friendly restrooms We've been coming here for years It's a shame that they don't have a baby changer in the bathroom.", 4, "pos"], ["First time customer Saturday afternoon (Oct25) first time visit Had breaded tenderloinvery good.", 2, "neg"], ["Old School Old school Midwestern down home cooking If you enjoy poorly prepared hash browns and soggy toast then you will love it.", 5, "pos"], ["Made me physically ill This was the first time I went to Apple Dumplin' and was extremely underwhelmed.", 4, "pos"], ["So much complaining Heaven forbid anyone would have to wait longer than 2 minutes for a nice refreshing \"homey\" custard.", 2, "neg"], ["Pretty good Local hangout for the u of i students.", 4, "pos"], ["Jarlingâ\u0080\u0099s Custard Cup To be honest, I cannot say that it has been a good summer, if I havenâ\u0080\u0099t made it to Custard Cup at least once.", 3, "neg"], ["Not so great WOWreally pricey stuff here That cone is about the size of a shot glass Dont know why this place gets all the love.", 2, "neg"], ["I didn't care for it but dessert isn't really my thing.", 4, "pos"], ["Great Service We had excellent service The food is pretty good also Although, I think that their prices are too high.", 2, "neg"], ["Thank you for the great dinner at the pasta dinner before the marathon! Great food and awesome volunteers!", 3, "neg"], ["Biaggi's Beautiful Go to Biaggi's once a month with family and wife goes once a week cuz its close to work Always great food.", 3, "neg"], ["Great gluten free menu knowledge and service.", 2, "neg"], ["I love their spaghetti and meatballs.", 5, "pos"], ["Simply the Best Blue Berry Pancakes I Have Ever Had.", 5, "pos"], ["From the service to the food, I've simply never had a better breakfast.", 3, "neg"], ["Used to work here Looking for a cook that used to work there in the early 90's (91, 92, 93?) His name was Randy.", 3, "neg"], ["Fantastic food & service! This place is the best! From the moment you enter the door you can tell why it is so popular.", 2, "neg"], ["Suprisingly very good!.", 5, "pos"], ["The veggie burger I had was good, but it was not made there - Sam's! Â Regardless my partner did really enjoy his burger.", 3, "neg"], ["Good food, crappy staff The food is reasonable But the staff is stuck up Never have any of them ever been friendly.", 3, "neg"], ["Better places for a burger Food is very expensive for what you get and the service is abysmal.", 3, "neg"], ["We went for dinner on a Tuesday night and only had to wait 5-10 minutes for a table Good food! Pretty bad service.", 3, "neg"], ["Burgers Solid tasting burgers Chose the special elk burger and it was good and cooked well Hand cut homemade fries.", 2, "neg"], ["Decent Food but not so Good Price Food was pretty standard, I ordered the garlic chicken with vegetables.", 4, "pos"], ["Feels Authentic Golden Harbor isn't much to look at from the outside or inside for that matter.", 4, "pos"], ["Perfect - here is a review for non Asians 1 The setup is different Be prepared This is neither McDonalds nor Bacaro\r 2.", 3, "neg"], ["Sorry but I will never come back, atmosphere is far from inviting and the food is not so great.", 4, "pos"], ["So we walked in Mega crowded And a huge menu all over the wall.", 4, "pos"], ["Doesn't look like much from the outside but the food is delicious.", 5, "pos"], ["Awesome! Only authentic Mexican food in c-u in my opinion My faves are the quesadilla con huitlacoche &pastor  volcanes Always fresh.", 4, "pos"], ["Excellent food I've been here multiple times since we moved into the champaign area.", 4, "pos"], ["I grew up traveling to Mexico a few times a year, Maize brings me back to those memories every time.", 4, "pos"], ["Wonderful authentic mexican food at very reasonable, down right cheap prices.", 3, "neg"], ["PRO !!!!.", 5, "pos"], ["AMAZING! service was spot on Everything was perfectly prepared We're hard to please and they exceeded our expectations.", 4, "pos"], ["Bold and Fresh This was our first time at Bacaro; a little hard to find, but well worth the look.", 2, "neg"], ["The class of Champaign Well prepared eclectic dishes with a fantastic atmosphere, wait staff, and wine selection.", 3, "neg"], ["What happened?? After writing glowing reviews and bringing lots of friends to Champaign to experience Bacaro, things changed tonight.", 3, "neg"], ["Great tap beer selection, cracker thin pizza crust, flavorful pizza, and great service.", 4, "pos"], ["No problem with service and definitely love their creative pizza options Had the salmon pizza, different but very good.", 4, "pos"], ["Horrible service People are very rude and disturbing This place deserves 0 star ranking .", 1, "neg"], ["Great looking place, not so good Food Loved how the place was decorated Looked like great billiards.", 3, "neg"], ["Meh The pizza was not filling at all It was tasty but reminded me of toppings on a saltine cracker.", 3, "neg"], ["This was a very unique place to eat It was late and this was the first place we spotted I was very pleased with the service.", 5, "pos"], ["Yes, Harry Carey's is gone and white sox grill is the replacement If I could have given a lower rating , I would have.", 4, "pos"], ["This restaurant was highly recommend by local and non-local friends as a must go.", 3, "neg"], ["The Purple Pig has delicious food at affordable prices, thereâ\u0080\u0099s always a big crowd and the tables are always full, (including indoor and o", 5, "pos"], ["Absolutely amazing restaurant It is so famous that there is a waiting even at 3 o'clock on a Friday afternoon.", 5, "pos"], ["There are multiple locations but the Pizza is great at any of the locations or for delivery.", 4, "pos"], ["I had a deep dish pizza with chicken, onions, spinach and mushrooms.", 4, "pos"], ["\"We had a great experience at Giordano's! As we entered the restaurant, there were many people waiting for tables; however, despite the crow", 4, "pos"], ["Back when I was in high school, about 12 or 13 years ago, my family took a weekend trip from Minnesota to Chicago, Illinois.", 3, "neg"], ["Giordano's was my first Chicago deep-dish pizza experience, and, oh how much I enjoyed it! The pizza has lots and lots of cheese (yummm!) an", 5, "pos"], ["I miss having tomato soup!! It was awesome.", 4, "pos"], ["Love everything about this place except and it is always difficult to get a seat which is why they donâ\u0080\u0099t get a perfect 5.", 4, "pos"], ["We were told this place was a must on our Chicago visit It's deep, think and filling Greatly enjoyed by our party.", 4, "pos"], ["we were lucky that we got someone else's reservation as it is difficult to get in without one.", 5, "pos"], ["Great meal with great service! This was one of the places I was really hoping would live up to the hype (first female top chef winner - Step", 4, "pos"], ["The pizza at this place is beyond words It has a blast of flavor with that warm and cheesy goodness.", 5, "pos"], ["Stopped in for a bite before my flight The wait was short, 5 minutes The food was good american fare.", 4, "pos"], ["Best deep dish in Chicago, which may mean it's the best on the planet.", 5, "pos"], ["Recommended to all the Pizza Lovers.", 5, "pos"], ["This place was great! I visited Chicago with some family members and we heard about Pequods so we had to try it and I loved it.", 4, "pos"], ["First time in Chicago and I must say this was one quintessential Chicago deep dish experience.", 4, "pos"], ["I visited Lou Malnati's during my first trip to Chicago this summer I went for a late lunch accompanied by my boyfriend.", 4, "pos"], ["Definitely the best deep dish pizza I ever had.", 5, "pos"], ["Yedigim en iyi pizza Cok uzun surede pisiyor Vejeteryan olani tercih ettik Medium olani 3 kisiye yetiyor Ortalama 40 usd kidibasi.", 4, "pos"], ["Love Chicago style pizza and two slices is the best I could do.", 4, "pos"], ["We were heading home A VERY busy Sunday night after the St Pat's Day parade, and lucky to get a table.", 4, "pos"], ["Atmosphere at The Gage was great, very jovial and the Amish Spiced Chicken with Bacon Jam was phenomenal! If itâ\u0080\u0099s Idaho Trout vs Amish Chi", 4, "pos"], ["The food was outstanding The ambience was outstanding You need a reservation and some nice clothes.", 4, "pos"], ["Venison burger is really tasty Huge Very filling But the flavors are so good.", 5, "pos"], ["Outstanding food and atmosphere Very attentive service.", 5, "pos"], ["We stopped for lunch on our way home from Cancun Wait was not long The food was really good.", 4, "pos"], ["You really need to focus on the meat for an experience out of this world, great choices, great taste, sorry the vegetarian-vegan life is not", 5, "pos"], ["Be sure you are hungry when you go here because you will want to eat yourself silly The staff is very pleasant and extremely attentive.", 4, "pos"], ["Came to this spot after my sister and brother in law raved about their experience at the other location.", 4, "pos"], ["Best to wear pants with a little stretch in them when you visit Fogo de Chao.", 4, "pos"], ["Had lunch here during a layover at Midway Busy place, short wait.", 4, "pos"], ["I had heard a lot about this place before I had visited and arrived with high expectations.", 4, "pos"], ["Amazing Italian restaurant in the heart of Chicago   Great service, love their way approach to wine offer.", 5, "pos"], ["Our last food destination in Chicago was Quartino,  an Italian restaurant suggested to us by a former student in the area.", 3, "neg"], ["One of the best locations in downtown for having food   I have to say that their service tops above all Its just perfect.", 4, "pos"], ["If you are near ORD and you want reasonably good food (granted near the airport prices) and you are maybe a little strung out from the road,", 4, "pos"], ["First time trying a Chicago hotdog I must say pretty Interesting to what is the norm in this place It lives it legacy of food.", 4, "pos"], ["A friend recommended this place for a Chicago style hotdog and I am glad I listenedÂ  to him.", 4, "pos"], ["Portillo's is a Chicago institution - there's no doubt about it.", 3, "neg"], ["Beside the Deep Dish Pizza, Chicago is famous for its hot dogs and Italian beef sandwich.", 4, "pos"], ["We were flying out of Midway Airport and we looked to Harry Caray's for a good dinner, as Harry Caray's had been one of our go-to restaurant", 4, "pos"], ["Been here twice The food is amazing, very similar to the Cheesecake Factory Loved the warm fish tacos and the appetizers.", 5, "pos"], ["Good place to go for lunch Has several dining areas We sat in the bar area and ordered the Mini Classic Cheese Pizza ($7.", 4, "pos"], ["Sorry, massive portions can't compensate for mediocre quality.", 3, "neg"], ["Omg! Best sandwiches in the city!!!!! Made to perfection, no additional sides needed but are available! Must eat here for best effect!  The ", 5, "pos"], ["Worth the wait for table - service is fast Food was so good - didn't feel like I was in an airport.", 4, "pos"], ["Went there based on the excellent ratings and reviews on zomato but I kind of don't agree with it.", 3, "neg"], ["Very cool atmosphere inside Feels very authentic Every dish tasted amazing and fresh.", 5, "pos"], ["It's an above average Mexican restaurant, there's no doubt about that The entrees are very small but pretty good.", 3, "neg"], ["This is our second dining experience at Frontera Grill.", 4, "pos"], ["The location is now closed I was here a week before they were shutting shop They were probably the best choice at midway at the time.", 4, "pos"], ["We eat here almost every trip to Chicago Our go to pizza is the deep dish Chicago style.", 5, "pos"], ["This place is horrible We ordered Pizza, cheese bread, and tiramisu for delivery.", 1, "neg"], ["I had heard about the deep dish pizza but being here realised how tasty it is  It's super delicious  and very famous in Chicago.", 4, "pos"], ["If you've never had deep dish pizza in your life (which was my case) - make sure to do some belly stretching prior to tasting it because.", 3, "neg"], ["Its been 4 months since i moved to chicago and this is my first ever review of Chi-Town! Its a cozy little space with really cute interiors ", 5, "pos"], ["If you are planning to visit this on the weekend be ready to wait for 2 hours to be seated It took almost 25 hrs for us to get a table.", 4, "pos"], ["This is one of the only places around that will serve an inverted pizza and is a delicious concoction of a pizza and pie.", 5, "pos"], ["It's cool, really tasty and original, took me for ever to get a table ! And there is no credit card accepted.", 5, "pos"], ["It is so different And sometimes, different is good  My friends suggested me this place and I am not at all disappointed.", 4, "pos"], ["My experience at Joe's Seafood, Prime Steak & Stone Crab was extraordinary.", 5, "pos"], ["Went to Harry Caray's during my layover at Midway They provide good food at a reasonably fast rate.", 4, "pos"], ["Stone crab is my favourite food item in the world, bar none It goes without saying that Joe's is the gold standard.", 4, "pos"], ["Enjoyed the seafood platter, it was cooked to perfection The onion rolls were a big favorite of mine.", 4, "pos"], ["We had a wonderful dinner at Joe's, celebrating a birthday and a graduation I had the Chilean sea bass which was delicious.", 4, "pos"], ["So leaving Chicago on Tuesday this week, I was intrigued to find the restaurant had changed to Go Go White Sox.", 4, "pos"], ["Xoco is a very vibrant mexican place Delicious food and great ambience.", 4, "pos"], ["Amazing Mexican sandwiches, fresh, flavorful and a smokey flavor  Outside and inside or carry out.", 5, "pos"], ["After Friday nights craziness I was hunting for a michelada on Saturday morning Found two Mexican places nearby and I picked this one.", 4, "pos"], ["we dined here during a 3 hour layover in midway.", 4, "pos"], ["This place has been here forever  I'm not an expert, but this is not authentic tapas.", 4, "pos"], ["My favorite tapas joint Great ambience Order anything and you wont be disappointed Lot of options for vegetarians.", 4, "pos"], ["Undoubtedly the best tapas and sangria in Chi town and one of the best in America! Even in the odd chance youre vegetarian, the menu has eno", 4, "pos"], ["If you are looking for Spain in Chicago you came to the right place! Amazing tapas and sangria.", 5, "pos"], ["Across the street from my hotel, I gave this a shot.", 4, "pos"], ["Here are the cons: over-priced, bad seating, and horrible music I love a good burger, they should invite Gigi Hadid to try their burgers.", 4, "pos"], ["If you're into heavy metal and burgers, this is the place for you! Loud music blaring makes me feel like a rock kid back in the 70s when gia", 4, "pos"], ["Let me tell you in the beginning: Much hyped place! The themed ambience is great We had the Slayer, Led Zeppelin and Iron Maiden.", 3, "neg"], ["Went on a Wed night at 5:30pmno waiting Mac and cheese with bacon as side dish was off the charts.", 5, "pos"], ["We had to catch the afternoon flight from Midway Airport We visited the restaurant for the lunch.", 4, "pos"], ["First time visitor for breakfastÂ  Fair prices considering the addressÂ  This place was jumping and had a good vibe.", 4, "pos"], ["Best breakfast we have eaten in Chicago  Every time we are in Chicago we eat at Yolk's for breakfast  They have a lunch menu as well.", 5, "pos"], ["Very good breakfast place Items are tasty Service is good Food portions are good It is usually very busy at the breakfast time.", 4, "pos"], ["This place has some of the best breakfast I've ever had They've got everything too.", 5, "pos"], ["Apparently the best burger in town, however I did not feel like it was.", 4, "pos"], ["I think of airport restaurants as serving average food at above average prices Not so Harry Caray's at Midway.", 4, "pos"], ["This is an awesome place to go!", 5, "pos"], ["Absolutely delish - everything!  I enjoyed the scrambled eggs with Foie Gras and their beautifully deliciously garnished Bloody Mary: pepper", 5, "pos"], ["You might have to wait in a queue to get a table at Au Cheval, but it's certainly worth it The burger is huge, juicy, and extremely tasty.", 4, "pos"], ["Little Goat Diner is an upscale diner experience with high quality food and a terrific atmosphere.", 5, "pos"], ["In June 2017 beloved Harry Caray's at Midway was replaced by a barely functional White Sox restaurant that serves mediocre food with a slam", 4, "pos"], ["Have had great experience with their breakfast food dining in and carrying out Neat '50's diner decor.", 4, "pos"], ["Fab breakfast, fab atmosphere   It took us about 20 minutes of walking, but the food made it completely worth it.", 4, "pos"], ["Delicious Great flavors Smoke fries are unique Okonomiyaki was my favorite, great balance of savory and sweet.", 5, "pos"], ["Bottega Louie is a bustling downtown cafÃ©, where itâ\u0080\u0099s not unusual to find 20 people waiting for a table for Sunday brunch.", 4, "pos"], ["So, I can see what the fuss is all about, in this workshop (Bottega) that Louie masterminds, on a corner of Grand S Avenue.", 4, "pos"], ["I love the mashed potatoes the most, smooth and tasty loved to have Salmon Benedict, pizzas and the portobello mushroom fries.", 5, "pos"], ["Very cute place.", 4, "pos"], ["The dining hall was huge and spacious, yet looked so elegant and posh with all the marbled walls and tables.", 4, "pos"], ["This place is an institution in LA and the first place we ate at after coming to LA We got the Lamb french double dip and it was soo good.", 4, "pos"], ["This is a place for meat lovers Historic eatery, though a bit of a tourist trap Prices seemed rather steep.", 3, "neg"], ["Classic old Downtown LA eatery Nothing fancy, but great in its way.", 5, "pos"], ["Among appearance you would think that it's not much until you sink your teeth into one of their French dipped sandwiches and your whole worl", 5, "pos"], ["Visited there with my friends Fantastic service and amazing food The Staff is very professional and friendly.", 4, "pos"], ["For starters, i ordered a chef salad & main course was the Oscar!  The wings were soo good loved the sauce.", 4, "pos"], ["Been thinking to try the chicken and waffle, since i never had one so in my visit to LA, had the chance to try this at Roscoe.", 3, "neg"], ["Roscoe's is an iconic place popular for it's chicken and waffles.", 3, "neg"], ["Roscoes is such a fantastic establishment! Family orientated, wonderful staff and amazing food! Every time i have been here the chicken has ", 5, "pos"], ["Good food but waiter wasn't that kind We left a 50$ on the bill and he never came back with the change.", 3, "neg"], ["I found street parking right across the street (bring quarters) We waited about twenty minute to place our order.", 5, "pos"], ["The Best Hot Dogs I Have Ever Tried In My Life United States Is Known For Hot Gods And Burgers.", 5, "pos"], ["This is really a place to check off your list of places to go when in LA Line was not too long, and I didn't know what to order.", 3, "neg"], ["I ventured to Pinks to try their legendary hot dogs- as expected the king was long.", 3, "neg"], ["Truely a LA landmark, the hotdogs to include the frys and onion rings were outstanding.", 5, "pos"], ["Favourite fast food joint It's amazing to see the same high quality across all franchises in America.", 5, "pos"], ["I don't really see what that fuss is about with this joint.", 3, "neg"], ["Every time i travel to LA  First stop: In n Out Butger.", 5, "pos"], ["Perfect burgers we had for lunch The buns were toasted perfectly and the patty was fresh and cooked well.", 4, "pos"], ["The most popular burger place in LAI always wanted to try it and i did more than 6 times It always tastes good and fresh.", 5, "pos"], ["We got takeout from there - two pizzas and a caprese salad.", 4, "pos"], ["Olives al forno, fried potatoes, mozzarella di buffala & pizza alla benno.", 4, "pos"], ["A cool place to enjoy Italian food and pizza with your special one or with friends Good sitting arrangement with a comfortable ambiance.", 4, "pos"], ["We went for dinner today there with family and friends We had to book in advance The place was packed, it has an amazing ambiance.", 4, "pos"], ["This place is definitely one of my favorite pizzas of all time I ordered Sausage Pizza and Salame Pizza and that was delicious.", 5, "pos"], ["Waffle â\u009d¤ï¸\u008f Enjoyed The ExperienceFood Was Tasty Well behaved staff.", 5, "pos"], ["To die for! The line was down the street but was quick and worth it.", 5, "pos"], ["i ordered the brunch menu but i forgot the name of it! mannnn the egg was so good, idk what they putted.", 5, "pos"], ["Incredible delicious food with unique combinations for breakfast Crowded place I ordered shrimp and egg whites with pesto.", 4, "pos"], ["Waited 40 minutes to enter, I thought to myself that it is worth the wait and that I had to taste the pancakes there.", 2, "neg"], ["So so so delicious! Someone recommend me to come here and I'm so glad we stopped because it was fantastic! The cookies are nice and gooey on", 5, "pos"], ["The chocolate chip Cookiesâ\u009d¤ï¸\u008f the cookies were freshly baked tasted just perfect.", 5, "pos"], ["Not bad for a quick treat to satisfy your sweet tooth but I still don't see what all the fuss is about.", 3, "neg"], ["Hands down one of the most fabulous cookie ice-cream sandwich or just the cookies, we have tasted! No wonder we had to queue but the line wa", 4, "pos"], ["Cheap cookies and fast service! I was skeptical because a cookie sandwich was only $2 so how good could it actually be? They were GREAT! It'", 5, "pos"], ["The Food was great but little expensive I spent $170 on lunch.", 5, "pos"], ["The best hot dog place I've ever been to! We got the fries, and the chipotle sauce was honestly the best chipotle sauce I've ever tasted.", 4, "pos"], ["Favorite place in LA! Everything is awesome, fresh and tasty If you are in Abbot Kinney you should def go there.", 5, "pos"], ["I had a good experience at this restaurant.", 4, "pos"], ["cool eclectic spot in abbot kinney with great rustic feel", 4, "pos"], ["My orders (2 people): Hot Italian  Vegetarian Italian   The vegetarian italianâ\u0080\u0099s garlic gave it soo much taste! I loved it! The pork was a", 4, "pos"], ["WurstkÃ¼che is definitely one of the gems of LA! Located in the hip area of DTLA ie.", 4, "pos"], ["I like their Nacho cheese, chili fries, sausages and French fries as well.", 5, "pos"], ["Amazing sausage spread with awesome sauces to compliment them The Belgian fries are one of the best I have had so far.", 5, "pos"], ["Worth the line serving unique sausages like rattlesnake which I enjoyed Serves be er, soda, and range between 6-85 for the \"dog.", 5, "pos"], ["I cannot even describe the flavors that come out of each bite! Just an amazing experience.", 4, "pos"], ["Some awesome food An experience to taste the different kinds of Tapas They even have a separate dessert room.", 4, "pos"], ["Amazingfrom A to Z, the service, the food quality, the servingsthis place is worth every dollar you spend.", 4, "pos"], ["The food here is phenomenal, it never disappoints this is a 5 star establishment.", 4, "pos"], ["We had the tasting menu.", 4, "pos"], ["I had the shrimp pasta this location serves some of the best fettuccine in West Hollywood the chef really knows how to cook the Delivery Swi", 5, "pos"], ["Best Brazilian cuisine I've had with many selections to choose from other than churrasco.", 5, "pos"], ["The chicken fingers and the fresh mozzarella Bruschetta,totally fell in love with them,so much perfection!!!nice ambience,great food!!!sharp", 4, "pos"], ["I had the burger and it was just ok It was really huge which was great since it was a little expensive, but it was just mediocre.", 3, "neg"], ["Only been once but I was impressed For being a relatively small place, they easily accommodated our large group.", 5, "pos"], ["First of all this restaurant is like a bar style there is no tables and Its good and clean, they have two kind of burgers I tried the first ", 4, "pos"], ["The Apple Pan is a total classic I've been going there since I was a kid, and their hickory burger is always memorable.", 4, "pos"], ["Very Tasty Burger and french fries Â Nice Atmosphere and professional staff I Like their services very much.", 4, "pos"], ["This is a true LA gem! I am not even exaggerating I had the best burger ever tasted.", 5, "pos"], ["Worst Burger in California Was told about this place from a friend and drove 1 1/2 hours to try what he called \"The best Burger ever\".", 2, "neg"], ["Just Delicious!  This is the top of the top restaurant! I have been in the best restaurants in the world ( 2nd, 4 th , 11, 50th best in the ", 4, "pos"], ["Food was very good, overpriced for an Osteria.", 4, "pos"], ["We had a great experience at Osteria Mozza.", 5, "pos"], ["We went to Mozza on Melrose for a Sunday pizza lunch.", 4, "pos"], ["Some great high end modern Italian Excellent staff, very knowledgeable and attentive, and a very pleasant evironment.", 4, "pos"], ["Ultimate food with great dining area I enjoyed the burger here with my friendsÂ  Everything is delicious.", 4, "pos"], ["A classic LA spot with a very large menu 24 hours for breakfast, lunch, or dinner no matter the hour.", 4, "pos"], ["I can never get tired of this place.", 4, "pos"], ["When you pull in, there's free valet parking This location was very mellow and had plenty of outdoor seating.", 4, "pos"], ["The burger is a little pricey at $12, but it's amazing The fries were the best part in my opinion though.", 4, "pos"], ["I love their meal sets and this really tastes good The line wasnt that long when I went but in the inside of the store it was almost full.", 4, "pos"], ["We got the shisho age which was ground tuna wrapped in shisho leaves and fried in a tempura batter,  Daikoku Ramen and the Spicy Miso Ramen", 4, "pos"], ["My go to place for ramen cravings Can really taste the flavor of the soup Recently tried the shredded pork bowl.", 4, "pos"], ["Was in little Tokyo and wanted to give it a go Coming from Vancouver, I wanted to give this place a go.", 3, "neg"], ["Ramen was delicious - you can really taste the pork flavor infused into the soup.", 4, "pos"], ["I had the buttermilk pancakes and the cappucino, tasty! The venue is great if you want to sit outside.", 4, "pos"], ["Very interesting outdoor sitting excellent food and tasty coffee, I recommended it for family gatherings, I tried it in the daytime and nigh", 5, "pos"], ["Let's start with the service Quick and to the point when you order So if you're really starving and it's not too busy, you'll be fine.", 4, "pos"], ["How can I explain the Alcove Amazing food, great atmosphere and extremely friendly staff My favorite place in town.", 5, "pos"], ["The best place on earth I love this place Visit at least once per week.", 4, "pos"], ["Such a pretty place! I love flowers and itâ\u0080\u0099s a flower heaven! I made a reservation online over a month earlier - itâ\u0080\u0099s that busy! They of", 5, "pos"], ["Favorite lunch spot  I had not been here in a few years.", 5, "pos"], ["How exciting! Greeted with a complementary glass of champagne on arrival.", 4, "pos"], ["@Great spot in Beverly Hills.", 4, "pos"], ["Another great meal Had lunch on Monday and once again, the food was greatthis place gets it right i love the shredded brisket.", 3, "neg"], ["One of the best places in LA!  The food is simply superb! Everything is on point and very tasty.", 4, "pos"], ["#LAFoodcrawlSecure advanced booking for guaranteed seats                       HITS: More than just the meat on the menu Unique and interest", 3, "neg"], ["Animal is an excellent restaurant with great food, great wines or beer depending on which you prefer and again, great food (cant stress that", 5, "pos"], ["Animal is awesome I have wanted to go here for some time and finally went for Brunch on Sunday The boner burger was delicious.", 5, "pos"], ["Amazing food and service The food was just tasty and the best sauces I have tried The wine selection was amazing.", 5, "pos"], ["Great seafood restaurant! Attentive staff, good selection of wines, very elegant interior, and nice atmosphere overall.", 4, "pos"], ["One of LA's best  Unparalleled seafood and more Fantastic service as well.", 4, "pos"], ["We had a pleasant dinner at Providence The menu has great selections of French and sea food Tasty and fresh Dressings are addictive.", 4, "pos"], ["By far the best seafood restaurant in So Cal! Execution on the most imaginative menu is punctuated by it's consistency.", 5, "pos"], ["Brilliant service & Superb food , very high standards that have set the bar to another level book in advance & very pleased to share this ex", 4, "pos"], ["My last minute research saved me otherwise I would have this jewel of a place and there iconic corn fed pastrami sandwich (so much meat that", 5, "pos"], ["Pastrami Sandwich is a must! One order is good for sharing for Asians Famous Restaurant, Where Harry Met Sally Try also their omelettes.", 5, "pos"], ["It was my first time going to this famous and hyped Katz deli in nyc.", 4, "pos"], ["What an experience! From the moment you walk into the deli it's buzzing and fragrant Yes there will be a line but you wont wait long.", 5, "pos"], ["Sandwich ninja!!  A must visit when in NYC .", 4, "pos"], ["Shack stacker plus bacon cheese fries and 50-50 Perfect combo for the hungry You will always leave here full.", 5, "pos"], ["Local informal e com bom ambienteÂ Pode deliciar-se com vÃ¡rias opÃ§Ãµes de hambÃºrgueres e milkshakes.", 4, "pos"], ["Great burgers We came here and we froze but it was worth it!   I loved every minute of it Been to a few burger places in my time.", 5, "pos"], ["We stumbled across the Shake Shack and just loved the look of it with the lights in the trees and the outside tables.", 3, "neg"], ["This is one of the best burgers I've had It's kind of my first time eating in New York city This is one of the best burgers I've had.", 5, "pos"], ["Nobu is an amazing Restaurant I Love the atmosphere there It is very calm and relaxing.", 4, "pos"], ["I had the worst experience ever here I don't live in New York but was here visiting.", 2, "neg"], ["We enjoyed the Chef's Choice menu Each dish was as delightful to the palate as it was to the eyes Beautiful and delicious experience.", 5, "pos"], ["Nobu has been a favorite in various locations (Malibu, the Bahamas, etc)  Went to this one with a friend.", 3, "neg"], ["I had the misfortune of falling for Nobu's notorious PR hype.", 2, "neg"], ["One of the best burger outlets in town; despite being in a hidden (not exposed) location at the Parker NY Hotel, yet this outlet still manag", 5, "pos"], ["Ganha pelo espaÃ§o escondido num hotel elegante HambÃºrguer bom, normal, sem puder fazer  grandes escolhas.", 4, "pos"], ["We came to the front of Le Parker Meridien and I thought a hole in the wall burger place can't be in here.", 3, "neg"], ["What an amazing discovery!!!!!! A must visityou surely can miss it It is INSIDE LePark Meridian Hotel.", 5, "pos"], ["Hard to find the location of restaurant It is the lobby of a hotel You can pick your burger and sit place you want.", 4, "pos"], ["The New York pie (pizza) story dates back to 1905 and the originality still takes you back to the rustic wood oven traditional Neapolitan Pi", 5, "pos"], ["The best place and the best kitchen! I will be back very soon! I have many photos of this amazing place.", 5, "pos"], ["The best!!!! The pizza here is delicious The base is amazing and the variety and quality of toppings is sooooo good.", 5, "pos"], ["Came here as part of my NYC pizza adventure and it was good.", 3, "neg"], ["Best pizza I have ever eaten in my life We went as a group of 3 people.", 5, "pos"], ["I really like this place:) banana pudding is my favourite I drank chai tea latte, it was so good You should try all tastes here.", 5, "pos"], ["We went there just to know why Jessica Parker loves that place We bought two cupcakes and they were pretty much normal and expensive.", 4, "pos"], ["Very cute bakery with a very warm cozy feel to it.", 4, "pos"], ["Well worth the wait! The cupcakes were so yummy, I still dream of them.", 4, "pos"], ["Por aqui respira-se sex and te city! Os cupcakes tÃªm um aspeto delicioso, e a conjugaÃ§Ã£o de sabores Ã© tÃ£o grande, que apetece provar to", 4, "pos"], ["I have to say that this place really lived up to the hype I read about online when I searched for places to eat in the city.", 4, "pos"], ["It has been quite some time since my first visit to Gramercy Tavern, but I still regard it as one of the most memorable, standout dining exp", 5, "pos"], ["I have to be honest I was fooled on this one.", 5, "pos"], ["It was a great dinner when enjoying at Gramercy restaurant, we were quite attentive by the restaurant staff, they helped me find my favorite", 5, "pos"], ["I had read so many reviews on this place that I decided to try it.", 3, "neg"], ["This happened to be my first restaurant to try out in New York City last year  We had opted this place for lunch.", 4, "pos"], ["Haven't eaten here but the cheesecakes are epic! Try the carrot cheesecake! But from what I've seen this place gets busy especially in the e", 4, "pos"], ["Food was alright Grits were super bland.", 3, "neg"], ["If you are a fan of real cheesecake, you must give Junior's NY cheesecake.", 4, "pos"], ["We were at Junior's about 9 pm midweek, so it was far from being busy Ordered a burger and a slice of cheesecake.", 3, "neg"], ["Amazing!!!!!! We stumbled upon this place by accident and are we glad we did! The food is sooo good and the many choice are great.", 5, "pos"], ["Was recommended highly by a friendÂ Â  Itâ\u0080\u0099s the place to try Italian food on Times Square Weekends is crazy, was told 1.", 4, "pos"], ["My family visit Carmine's every Christmas holiday as a tradition.", 1, "neg"], ["Go Big Or Go Home   If the evening wasnâ\u0080\u0099t magical enough after watching the Phatom of the Opera, it sure got a whole lot better at Carmine", 4, "pos"], ["We had a great experience! Amazing flavours, the waiter was so helpful and recommended excellent dishes.", 5, "pos"], ["This restaurant has managed to keep its top quality throughout the years Great atmosphere, great service and great food.", 5, "pos"], ["Deliciously tasteful delights!!Â  And its ambience is uniquely Manhattan.", 5, "pos"], ["Elegant restaurant with unique style Loved the design and decoration The ambiance is relaxing Food is great and presented beautifully.", 5, "pos"], ["Decoration is so cool! ð\u009f\u008d¹ Cocktails are tastelicious and the desert is a musttt!!  The waiters and the hostesses are friendly !  Tryyyy th", 4, "pos"], ["Came here to grab a couple of doughnuts, my friends didn't want any (what?!) so I devoured them myself.", 4, "pos"], ["So fun! Loved the variety of all of the donuts Every single one we tried were so delicious and fresh Very easy to find and walk to.", 4, "pos"], ["Nice and fancy retro atmosphere with good staff Exceptional food delicacy If you're looking for a different experience, worth a try.", 4, "pos"], ["Holy cow There are no words to describe these donuts, especially their creme burlee.", 5, "pos"], ["At their best, a donut is the perfect diet buster and will be worth every bite.", 4, "pos"], ["I really liked that they have an all day breakfast The staff is super nice (the waiters are, the lady at the entrance not really).", 4, "pos"], ["Cafeteria gets a lot of things right- great, innovative food, a happy, upbeat, modern ambience (including great music), and very nice and fl", 4, "pos"], ["Brunch is especially good if you can get a seat.", 4, "pos"], ["Part children play ground, part mini market, part hippy cafe and part neighborhood museum this place has amazing food and coffee.", 4, "pos"], ["Wonderful brunch! We had to send back the french toast because it was cold but they remade it and brought it right back out! Everything was ", 3, "neg"], ["Great place for a french breakfast Very well localized in a cute neighborhood.", 4, "pos"], ["French restaurant very good opulent authentic excellent food and service, international clientele.", 4, "pos"], ["A staple visit every time I am in NYC Busy, bustling experience with outstanding breakfast menu.", 4, "pos"], ["My order at Balthazar was not elaborate at all.", 4, "pos"], ["The food is always great and the service is always amazing.", 3, "neg"], ["Damn was this Chinese good.", 4, "pos"], ["Long wait leads to outstanding food A must go in Chinatown First place I tried the soup dumplings.", 4, "pos"], ["Pork Steam Buns Fried Pork Dumplings Kung Pao Chicken  Pan Fried Noodles with Beef  Originally located in Flushing, the Soup Dumplings such ", 3, "neg"], ["Now, there are a lot of Chinese food places claiming to be the best in NYC but this one has all the others beat! You go into the restaurant ", 4, "pos"], ["We were waiting for 20 min to get our seats and were sited with other people.", 4, "pos"], ["I had never tried Mac and Cheese in my entire life, so when I went to New York, I couldn't wait to try this so typical American dish.", 4, "pos"], ["America's most favourite dish is served with amazing flavours The have the just right amount of mac and cheese.", 5, "pos"], ["My friend and I ate here for dinner on a Saturday night and it was not crowded.", 4, "pos"], ["NiceÂ  place  Good forÂ  friends and familyÂ Â  Ambiance and music is greatÂ Â  Best cafe in this area I liked theirÂ  red sauce pasta.", 4, "pos"], ["Really excellent and varied food, especially considering they only serve mac 'n cheese.", 4, "pos"], ["Famous for its frozen hot chocolate You have to get some to know why.", 4, "pos"], ["Came at 11pm.", 1, "neg"], ["The frozen hot chocolate is the only thing this place has going for it.", 2, "neg"], ["Both the mint and peanut butter frozen hot chocolates looked great and tasted great BUT were something That i could re-create at home withou", 2, "neg"], ["\"The world famous frozen hot chocolate was well worth the wait To sum it up, it is a like a hit chocolate smoothie.", 5, "pos"], ["We came to New York eager to try some authentic NYC pizza, and decided on John's They didn't disappoint.", 4, "pos"], ["We read excellent reviews on Zomato but this place did not live up to expectations.", 2, "neg"], ["Muy buen lugar para ir en un grupo grande Las pizzas son bastante contundentes, recomiendo la pizza clÃ¡sica de mozzarela.", 4, "pos"], ["BEST PIZZA I'VE  EVER HAD  I can still remember the taste of that extra cheesy pepperoni pizza in my mouth.", 5, "pos"], ["Good quality, delicious food that you will like Large variety, good drinks, spacious, comfortable Service was good, people were friendly.", 4, "pos"], ["Who gave this place a star?! The food is pretty good, and everything else is kind of a joke.", 3, "neg"], ["The lunch tasting menu was a great way to experience Babbo.", 4, "pos"], ["Lunch here is pricey but it is amazing! Truffle pizza to start is a must.", 4, "pos"], ["Seriously good food Not cheap but you can see the value I had the Grilled octopus and Rabbit - both incredible.", 5, "pos"], ["Memorable experience Went with my wife in March.", 4, "pos"], ["Lezzet ve et konusunda sÃ¶zÃ¼m yok ama tek kiÅ\u009filil steak almak mÃ¼mkÃ¼n deÄ\u009fil en az iki kiÅ\u009filik O da 110 dolar civarÄ±nda.", 4, "pos"], ["Meat ninja!  Famous for over 125 years for their dry aged steaks , so we can study and find the water.", 3, "neg"], ["Very buisy restaurant We had to wait at least half an hour to get a table Buzzy atmosphere The staff are welcoming and accommodating.", 4, "pos"], ["Itâ\u0080\u0099s Luger Steak is always perfect As Nick Solares would say Luger is THE quintessential NYC Steakhouse Canâ\u0080\u0099t be equaled.", 5, "pos"], ["Last night again we were greeted with the usual loud buzzy atmosphere, always loads of people waiting for their table in the bar.", 3, "neg"], ["Pork belly buns are awesome - as always across all of the Momofukus.", 4, "pos"], ["We had to wait a bit while they prepared our table of five and we ordered up a bit of everything from each category.", 4, "pos"], ["I came here last year on a previous visit to NY and remember really enjoying the food and the contemporary, casual approach.", 3, "neg"], ["Trendy decor and you can feel the cool vibe as you walk in.", 4, "pos"], ["I told myself if I ever came back to NYC, I would make a meal out of just the pork buns Four Pork Buns LaterMission accomplished.", 5, "pos"], ["This place is a great guilty pleasure  Fun atmosphere and donâ\u0080\u0099t let long lines detour you- they move the line fast.", 4, "pos"], ["Average food that's pricey and not worth all the hype.", 2, "neg"], ["Cheap and bad tasting food Way over hyped There are numerous far better Greek restaurants out there.", 1, "neg"], ["Superb place and enjoyed my food Great atmosphere with charming staff I will be back soon for more tasty Melizano Salata.", 5, "pos"], ["This is the where I taste different foods Ambiance was okneed to have service faster than it had.", 3, "neg"], ["This place really awesome with good food and some really nice sandwiches.", 4, "pos"], ["I had been waiting years to try this place Not sure why I waited so long Parking is very limited as the place is small and busy.", 5, "pos"], ["This is a tiny little cafe tucked behind Blue Fish House and Capones Oven & Bar.", 4, "pos"], ["best lunch spot Had theÂ  salad sandwich very deliciousservice was quick and staffs member are very friendly.", 4, "pos"], ["I had the Hickory Chicken which was good, followed by the pecan pie which was delicious! The Middle Earth theme is eye-catching for sure.", 3, "neg"], ["â\u009c\u0085 I love everything at The Cheesecake Factory  â\u009c\u0085 Most of foods are delicious  â\u009c\u0085The staff is friendly and nice â\u009c\u0085The place has 2 floor", 4, "pos"], ["Smart Casual dining which also tastes wonderful The salads, pastas are a must try.", 4, "pos"], ["Amazing dishes, good looking and great taste! Tried the French Country Salad, the Hot Spinach and Cheese Dip, and the SkinnyLicious Soft Tac", 4, "pos"], ["Massive portions!! Be prepared to leave without having room for dessert, they do take away though and the best Oreo cheese cake I've ever ha", 4, "pos"], ["So what does one rate when you go to a Cheesecake Factory ? The meal or the cheesecake slice(s) that you take home to devour ?  This outlet ", 3, "neg"], ["Used to live in Houston and drove past this place all the time Back for a visit and staying nearby so I dropped in for a meal.", 3, "neg"], ["Authentic Italian food and an authentic Italian-American experience Loved the unique flavours and generous portions.", 5, "pos"], ["Reservations are welcomed but are not necessary  My wife made one for a Friday night  That turned out to be a great decision.", 4, "pos"], ["I really enjoyed my cocktail, an old fashion,  the Caesar Salad, bread and herbed olive oil and my special of the day which was a capellini ", 4, "pos"], ["Wonderful food! Great romantic atmosphere Nice prices on wine Zucchini appetizer with veal piccata and a superb Italian steak.", 5, "pos"], ["The food came out quickly and I was transported to food heaven The fried chicken was the most well-seasoned chicken I've ever had.", 5, "pos"], ["Had been to this place on a Saturday morning to have brunch , awesome staff and good service, sitting is good and comfortable, had ordered c", 4, "pos"], ["We enjoyed the best breakfast here! The experience started with being greeted by an extremely friendly hostess handing us menus and ensuring", 5, "pos"], ["Food was great service great! There was a line but it went fast they take order outside and food is at your table 5 mins after you sit would", 5, "pos"], ["Service was awesome, but as far as chicken and waffles go, I was pretty disappointed.", 3, "neg"], ["Really neat how there's a variety of meats that you can choose from and have it cooked your way.", 3, "neg"], ["The ambiance is just perfect and the service too! Waiters are very welcoming and helpful.", 4, "pos"], ["The meats come in various cuts with some very tender ones.", 4, "pos"], ["I have been here numerous times and have always been pleased here   I have been for lunch and dinner   Steaks are great and sides too.", 4, "pos"], ["I was in town with my counterpart for a business meeting and he recommended Taste of Texas Excellent choice Rolls are a killer.", 5, "pos"], ["I don't have to say much about Hugo's It is a great place You can't go wrong with the food here It is Mexican fine dining at its best.", 4, "pos"], ["This place is very fancy, the food is good and service is also great.", 4, "pos"], ["I started with the Queso Flameado which was really good Theirs has chilis, mushrooms, and steak it.", 5, "pos"], ["This was a frustrating and underwhelming experience  It started with our waiter not taking our order for 10 minutes( it was not busy).", 2, "neg"], ["They will tell you immediately after they seat you that Hugo's is not a Mexican restaurant, but I think who they are is so much greater than", 5, "pos"], ["Service is always great - fast and friendly Atmosphere is very comfortable and inviting Great TexMex without getting expensive.", 4, "pos"], ["Bang Pow Enchiladas.", 3, "neg"], ["Fun atmosphere.", 3, "neg"], ["Bad food and poor customer service Ordered a to go meal Upon pick up the attendant handed me the bill then disappeared.", 2, "neg"], ["Great burritos Great macho burrito with the green chili sauce The cactus margarita was great too.", 3, "neg"], ["A perfect escape to explore the carnivorous tastebuds perfectly cooked juicy smoked meats beef briskets must try.", 5, "pos"], ["I'm really picky on my barbecue, especially the sauce This was not a disappointment.", 3, "neg"], ["So Apparently I hadÂ been eating terrible Brisket my entire life and was completely unaware of it That is until I ate at Goode's.", 4, "pos"], ["It's not what it used to be Goode's has expanded beyond their capabilities Too many locations and quality has gone right out the door.", 2, "neg"], ["Great atmosphere and good food Had the pork ribs which I would definitely reccomend Had the smell of smoke on my hands all day.", 4, "pos"], ["Veal torino my favorite Spicy creamy sauce over veal cutlets  just YUM ! My favorite must try.", 5, "pos"], ["Excellent pasta dishes Penne napolitan w blackened chicken and formaggio with blackened chicken.", 4, "pos"], ["Food is great here I have tried many of their menu dishes and all of it was great Their fettuccine alfredo is by far the best.", 5, "pos"], ["First time Â and we were nicely surprised.", 4, "pos"], ["Chicken Florentina stuffed with spinach and cheese and shrimp parmigiana with creamy risotto was great Spinach mushroom strawberry salad wit", 5, "pos"], ["I have been here because this is my brother's favorite pizza restaurant.", 4, "pos"], ["I went here with students before a field trip They took such good care of us.", 5, "pos"], ["The pizza was great, they were open late, and were able to accommodate 9 on short notice.", 4, "pos"], ["Star pizza is a Houston institution Everything is made fresh and you have lots of choices with their extensive menu.", 4, "pos"], ["Star Pizza falls right in the middle of the food spectrum It isn't bad but it isn't good either I probably will not be back.", 3, "neg"], ["The food here was great, and it has fantastic views of the beach.", 4, "pos"], ["Wedge salad was best part of meal  They tried to serve the redfish before we were halfway through the salad.", 2, "neg"], ["Totally Overrated! Absolutely Overpriced! We visited for the first time on Saturday night on Memorial Day Weekend when visiting Galveston.", 3, "neg"], ["The place was nearly empty upon arrival, waited forever before a server came to greet us at our table.", 2, "neg"], ["Brittni was an amazing waitress  We had a large group and they got us in right away  The food was incredible.", 5, "pos"], ["For an intimate venue where you can have coffee and quiet conversation or a drink outside on their patio Brasil is a venue I recommend.", 4, "pos"], ["They charged extra if you want more than 1 refill of coffee Some kind of special bean said the owner The coffee is weak.", 2, "neg"], ["Exceeded all expectations by far! Tamales are delicious, and they have vegan options.", 5, "pos"], ["Love the laid back vibe of the place and the menu A very healthy and eclectic offering.", 3, "neg"], ["This review is for breakfast, only.", 4, "pos"], ["Best breakfast in Houston! Outstanding concept and food.", 5, "pos"], ["It was really confusing when we walked in, you have to walk to the back to pick out drinks and place your order, then they give you a buzzer", 1, "neg"], ["Black Walnut Cafe in The Woodlands - remains a popular spot but for a place with counter service and higher than average pricing, we have to", 3, "neg"], ["Hamburgers great quality with many fixings Kids menu very adequate Service is prompt with pleasant atmosphere.", 4, "pos"], ["Been to the Black Walnut recently and it didn't live up to the old location reputation.", 2, "neg"], ["Saumon Ã  trois salmon three ways is definitely an order again dish Atmosphere is good with great service.", 5, "pos"], ["Wow! Guy was absolutely right on with this one Love the atmosphere The service is good and so is the food Very chill.", 4, "pos"], ["I have only been here a couple of times but the food has been great   Parking has been hit or miss.", 4, "pos"], ["I went to Grand Lux on yesterday I ordered chicken alfredo and buffalo wings, as a result I was food poisoned I called this morning and repo", 1, "neg"], ["Grand Lux is a nice restaurant  kind of a Cheesecake Factory meets ancient Egypt thing going on.", 4, "pos"], ["Great Churrascaria!Â  Meats are excellent and plentifulÂ  However I feel the salad bar is the highlight of the dinner.", 4, "pos"], ["Fine dining is nice for the occasional treat.", 5, "pos"], ["My mom and I were passing through on our road-trip back to San Antonio and decided to stop by for a nice dinner with our friend, a recent Ho", 5, "pos"], ["Fogo de Chao is awesome, at every location, for any occasion; and get this, I'm not even much of a red meat eater! The salad bar alone is en", 4, "pos"], ["Wow and wow! Exceptional foodbest piece of the night, and there were so many to choose from, was the bacon wrapped chicken.", 5, "pos"], ["A long time Montrose favorite for brunch and casual gathering The place is always busy.", 3, "neg"], ["This is a nice, quaint place, but it come off as a tad bit overrated to me Â I had the omelet, potatoes, and fruit.", 3, "neg"], ["Delicious food, find your own seat, own drinks! I had a beautiful spread of eggs, fruit, roasted potatoes! Fresh juice !! Fresh and deliciou", 4, "pos"], ["this is a test review for photo upload this is a test review for photo upload  this is a test review for photo upload.", 4, "pos"], ["Pleasant surprise! We arrived at the prime brunch time (noon), and there was plenty of parking.", 5, "pos"], ["Great restaurant! Food was amazing, with extremely good portions and superb flavors.", 4, "pos"], ["I didn't exactly scoff when I looked at the sandwich menu, but I was taken aback somewhat when I saw that most of the selections were $20.", 4, "pos"], ["Met a friend and had lunch at K & Z's recently.", 4, "pos"], ["This place is better than the Bagel Deli in Denver Big deli sandwiches with big flavor The desserts are huge The menu is giant.", 5, "pos"], ["One thing to say - it is huge Come hungry or don't come at all I don't think I have ever seen a sandwich so big.", 4, "pos"], ["We have only had those hard shell difficult to eat tacos filled with beans before coming to this place.", 4, "pos"], ["Service was prompt and food and out pretty quickly Enjoyed the selection, wish they had different drink choices on the drink fountain.", 4, "pos"], ["Enjoy the tacos but come on; is there a dirties place, either location, and the service is non existent past the register but they say you c", 3, "neg"], ["i found this place to not live up to the hype i am a taco fanatic, and these were mediocre at best 4 of us dined.", 2, "neg"], ["Austin-ish taco shop, expanded into Houston   Comical menu, including \"white trash\", \"republicans\", and \"democrats\".", 3, "neg"], ["My wife and I were invited by friends for breakfast and we had a very pleasant experience.", 4, "pos"], ["Ok so my experience didn't start too well - there are major roadworks all around this location making it a pain to get to the car park and t", 3, "neg"], ["One of my dear friends celebrated her 25th birthday here We came on a Sunday afternoon for brunch It was very crowded but not chaotic.", 4, "pos"], ["Delicious lunch experience  Backstreet #burger was cooked perfectly and the chocolate CrÃ¨me Brulee was not super rich like you'd assume.", 4, "pos"], ["A perfect brunch spot for families! Love the Orange Chocolate Brioche Buns for starters! The live jazz performance (usually on the weekends)", 4, "pos"], ["Itâ\u0080\u0099s a must place to go in Miami Stone crabs are part of the city history and this is the place to go to enjoy them.", 4, "pos"], ["Joes Stone Crab take away night   Walk up to the counter and place your order of crab, lobster, shrimp, salads, sides and desserts.", 3, "neg"], ["A must try if you ever visit Miami It opened since 1913.", 4, "pos"], ["A fantastic experience! shrimp, crab and a wonderful Californian wine, a pleasant surprise It was worth it to celebrate my birthday.", 4, "pos"], ["No body can give this spot anything less then 5 stars.", 5, "pos"], ["It is a recommended restaurant in Miami, said most of locals Big place serving cuban food.", 4, "pos"], ["This is the best Cuban food anywhere!!  Cuban sandwiches are amazing and the ropa vieja is out of this world - tender, juicy and so tasty.", 5, "pos"], ["One of the best places in Miami to have Cuban food.", 4, "pos"], ["Came for dinner here after discovering this restaurant on yelp and other popular sites.", 4, "pos"], ["Yes, Yes, and Yes! Amazing authentic Cuban food and not to mention the mojito pitcher is AMAZING Highly recommend.", 5, "pos"], ["Amazing place with great and tasty food, drinks were fabulous.", 4, "pos"], ["I walked into this restaurant for my first taste of Cuban cuisine because of 2 reasons- 1 Because of its high rating online &  2.", 4, "pos"], ["Food was just ok Ordered chicken soup and could tell it had been prepared several hours before The noodles were way too soggy.", 3, "neg"], ["Overall, an enjoyable visit I had the churrasco (skirt steak) that was perfectly cooked medium, very juicy and delicious.", 3, "neg"], ["Appetizers were delicious had the stuff yucca fried yucca and green plantains.", 4, "pos"], ["Food is over priced Went for breakfast and spent $65 on what some basic food.", 3, "neg"], ["Ubicado en South Beach, este lugar se caracteriza por estar \"open all day\" y por su variada y extensa carta Hay desayuno todo el dÃ­a.", 3, "neg"], ["El servicio impecable, el lugar mÃ¡s americano no puede ser, tiene una amplia carta.", 3, "neg"], ["A great to place to eat especially when you are going to hangout with family and friends Quick services and mouth watering food.", 4, "pos"], ["I really enjoyed lunch here, the waiter was really nice and all the staff was carrying, the food was good and it was not overpriced consider", 3, "neg"], ["Enjoyed a nice dinner here the other evening  Filet mignon, grouper, crab cakes  good service  Great drinks  Lovely ambience .", 4, "pos"], ["This place still reign supreme in south beach! The food, service, and ambience is amazing I took my family for the first time.", 5, "pos"], ["Don't even bother  It all depends where you are  If you want a great dinning experience this is definitely not the place If you want to prov", 1, "neg"], ["Steak is amazing!!!!! My favorite place to go on a special occasion The food is great and the atmosphere is wet welcoming.", 5, "pos"], ["I love this place! Timely service, in a super crowded area.", 4, "pos"], ["Simply outstanding!!! The food was second to none and the ambiance was truly a treat! I don't see how the restaurant can be negatively revie", 5, "pos"], ["A fabulous restaurant with a fantabulous concept and even better food!! The service was just great too! I really can't fault it and its usua", 5, "pos"], ["This has to have been one of the most entertaining restaurants I've been to.", 4, "pos"], ["Went there for drinks! Amazing experience and amazing drinks! Have to go there for the experience! They put nitrogen in your drinks, so it's", 4, "pos"], ["Presentation not worth the price When the average of the main course are 35 the waiter should inform in diners when the special is $89.", 5, "pos"], ["Place is nice and drinks are good and well elaborated .", 3, "neg"], ["We went for lunch Food was good but really outrageously expensive for what it is 6 orders, bite size, and 3 mijotos 150$.", 3, "neg"], ["Sugarcane is exquisite I've came here solo, with friends, with family, on datesthe ambiance is so chill you forget you're in midtown.", 4, "pos"], ["Globally-inspired small plates come from three distinct kitchens - a robata grill, raw bar and hot kitchen â\u0080\u0093 and provide eclectic selectio", 4, "pos"], ["Sugarcane is part of Samba Brands Management which also manages Bocce and Sushi Samba.", 4, "pos"], ["Had dinner here tonight with my husband and my Mom for the first time.", 5, "pos"], ["Love this place! The atmosphere is fun and quirky.", 4, "pos"], ["From the moment you walk onto the front yard of this rustic little house that has been converted you know you are in for a treat! Secure you", 4, "pos"], ["A wonderful experience First time and everything about the place was a plus great and unusual art and furniture.", 2, "neg"], ["Love the atmosphere here.", 4, "pos"], ["Great ambience and restaurant find in Miami I've seen this restaurant in other cities but have never tried it.", 5, "pos"], ["I had the fried chicken which was delicious and juicy  The greens was a bit spicy but good.", 4, "pos"], ["Visiting from New Zealand a group of us visited one evening on a very busy evening.", 4, "pos"], ["Awesome place for the late night dinner I prefer this place for some special reasons.", 4, "pos"], ["We went to this place because of all the recommendations that it had both here on Zomato and from other sites and we took the opportunity to", 3, "neg"], ["Maybe one of the best places in Miami to have a nice dinner Good and fresh food with a well executed service.", 4, "pos"], ["This is one of the most refined restaurants in Miami hands down and one of the few where waitpersons are dressed to match up the elegant eti", 4, "pos"], ["Really enjoyed this spot Service is spectacular--I lost count of how many waiters we had attending us The food was top-notch.", 4, "pos"], ["GOOD THINGS Amazing location, between the bay and the Miami River  Fish is the top, both for freshness and quality.", 3, "neg"], ["This place is delicious, beautiful with amazing views, and all of the servers are kind and on point- they always know what they're talking a", 5, "pos"], ["Supper at Otentic this evening   Chardonnay appetizers arrive with a taster tapenade with the menus.", 4, "pos"], ["Went for lunch and it was really good  I had the salmon pasta which was super fresh and light.", 4, "pos"], ["Popped in for dinner Great food Great service Great atmosphere Jaksbjabsijs  F s G g F   S    d sins  Skis skjdjjd D Did.", 4, "pos"], ["The steak filet was the best I have ever had in my life, and I have had a whole lot of steak but this was cooked to perfection, juicy and te", 5, "pos"], ["What a great experience - we'd been to a couple restaurants and found everything to be overpriced (tourist area) for the product.", 5, "pos"], ["Lugar lindo!! Com vista fascinante para o mar azul turquesa! A arquitetura do local tambÃ©m muito charmosa O atendimento impecÃ¡vel.", 5, "pos"], ["Was a disappointing visit.", 2, "neg"], ["I had the most fabulous food at S&W.", 5, "pos"], ["Another SoBe tourist trap  I can only go there for drinks or hosted events because I have given up on them.", 1, "neg"], ["Smith Wollensky Great place to go for a special occassion The food quality was outstanding and the service was equally a good.", 3, "neg"], ["La Sandwicherie is one of the top-rated restaurants in South Beach, so I decided to give it a try one night.", 4, "pos"], ["First visit to Miami googled places to eat saw this place had a good rating decided to check it out.", 5, "pos"], ["Um restaurante \"de rua\" que merece ser visitado Conseguimos o famoso lugar no balcÃ£o pelo que tivemos o prazer de jantar por aqui.", 4, "pos"], ["I stayed at an international hostel a few steps from this place and used to pass by it.", 4, "pos"], ["South beach e inen 14th caddenin sonuna dogru kÃ¶Å\u009febaÅ\u009fÄ± bÃ¼fe tarzÄ± sevimli bir mekan.", 5, "pos"], ["One of the best waterfront spots in Miami This place is all about the view The are very regular with food and trying to improve.", 3, "neg"], ["A decent brunch experience in downtown Miami.", 3, "neg"], ["This is a locals resto bar in Brickell that seems to be pretty rockin' on the weekends.", 3, "neg"], ["Wow, can't wait to go back! The food was so delicious! I loved the Serrano croquettes and eggplant appetizer.", 3, "neg"], ["Love the menu This restaurant has a menu where you choose a app and then your meal for a reasonable price.", 5, "pos"], ["When I first came to Jupiter I had asked several people where a great place was for dinner, most of them recommended the Food Shack.", 4, "pos"], ["Super cool place Even with it being in a strip mall this place gives you the feeling of being at the beach.", 3, "neg"], ["Always Creative I recently sat at the bar for dinner and the daily menu was great.", 3, "neg"], ["Your Kiddin? Waited too long  Over-hyped.", 3, "neg"], ["OMG! the absolute best food I have ever had! Amazing and worth every penny!!", 4, "pos"], ["A great place to celebrate your hunger Delicious food and nice environment Sitting is perfect for any kind of people.", 4, "pos"], ["I came here with my friend The food was beyond expectations, quick service Their Staff was very attentive.", 5, "pos"], ["One of my favorites restaurants in Miami! The food is great (don't miss the Goat Cheese croquetas!) and the service is very good! Perfect fo", 4, "pos"], ["Michael's Genuine Food & Drink is characterized by its weekly-changing menu, fresh local ingredients and a broad array of alcoholic drinks, ", 4, "pos"], ["I had an excellent Â brunch with my friend at Michael's Genuine Food & Drink.", 4, "pos"], ["A nostalgic stop along Federal Highway taking you back in time with it's decor and old-time candy selection.", 4, "pos"], ["One of the best places for ice cream and snacks! Though some 25 miles from our home, we used to go there regularly.", 5, "pos"], ["Be prepared to wait in line for a while, but Jaxson's ice cream is pretty darn good.", 4, "pos"], ["People complain too much This place is great A bit overpriced but the ice cream is huge, fresh and really good.", 4, "pos"], ["Overpriced, not worth the extra We're all for spending extra money on quality ice cream.", 2, "neg"], ["This restaurant is only getting two stars for the service which was great The food was not good at all.", 1, "neg"], ["Went with coworkers  One had the cod sandwich with fries- said it was very good The other and I both had mahi sandwiches - was good.", 4, "pos"], ["Great local spot to hang out on the deck, enjoy music, and good shrimp", 4, "pos"], ["Love this place!! Staff fantastic!! Food delicious!! Music and view unbelievable!! Try the Burgers from the grill!!  Stuffed clams delicious", 5, "pos"], ["Great service and atmosphere! We sat at the raw bar while waiting for a table, and had oysters and drinks! For dinner we sat outside on the ", 5, "pos"], ["This place is very nice and unusual  I thought at first it was just a grocery until I saw the restaurant behind it.", 5, "pos"], ["This place has been here for over 2 decades now and has awesome ambiance, the bar has happy hours so the drinks are cheap also.", 5, "pos"], ["Perriconeâ\u0080\u0099s has been in business at the same location for over 20 years, serving up Italian fare in a spacious and homely venue that also ", 4, "pos"], ["You must try the baked Brie !!!!! Amazing! I went here for a girls night dinner, the atmosphere is great, service is quick and the servers a", 4, "pos"], ["Just went today to this restaurant Very close from the hotel I was staying at on the port of Miami The atmosphere was very nice and calm.", 5, "pos"], ["Great location and nicely decorated place Food is good and the menu is simple Some dishes are very attractive and tasty.", 4, "pos"], ["Pubelly is one of the best places to have dinner in Miami It's small plates or tapas and the cuisine is American with Japanese influence.", 4, "pos"], ["475 Stars out of 5 Excellent Food Need some AC Cool Vibe, beautiful area.", 3, "neg"], ["Dumplings There's not much to be said about this place that hasn't already been said It's great Just go.", 4, "pos"], ["Drinks and asian-inspired selections.", 5, "pos"], ["The place is good to have BBQ Southern BBQ and food is good It is centrally located in downtown Atlanta Must try for good food.", 3, "neg"], ["This is as good as BBQ gets I'm from Mississippi and came here with one of my buddies and had the chicken wings appetizers.", 4, "pos"], ["Great barbecue! A little busy but weeknights are the way to go.", 4, "pos"], ["The food is amazing, service was great, and reasonably priced! I got the pulled pork, Frito pie, and tater tots.", 5, "pos"], ["Really good BBQ I got brisket, ribs and pulled pork with collard greens and stew.", 4, "pos"], ["Very cool and Iconic Worlds largest drive up restaurant We ate inside, also huge! Everything we had was so good and fresh.", 4, "pos"], ["If you want greasy, makes you feel good foodthis is the place Super crispy onion rings and the chili slaw dogs are delicious.", 5, "pos"], ["Varsity is a good place to hangout in downtown Atlanta It is centrally located and gives good food Hot dogs and Burgers are good.", 3, "neg"], ["Very unique building where you can feel the history The classic chili burger and dog were good and cheap.", 3, "neg"], ["Giving it a 1 star because I can't give it a zero  The frozen burger patty was cold and not cooked through.", 1, "neg"], ["Been coming here for years now and this place has been heading down hill last trip was the worst.", 3, "neg"], ["I can't recommend Flip Everything I ordered was a disaster.", 2, "neg"], ["Limited menu, but my large party ordered most of it and shared the tastes around All excellent.", 4, "pos"], ["Excellent presentation and style in this hip and happening burger joint Fresh, unique burgers.", 4, "pos"], ["Nothing special.", 4, "pos"], ["First thing about this place is it is a bar Smoking is allowed, and the interior smells of it.", 4, "pos"], ["These place is amazing.", 5, "pos"], ["I love restaurants with lots of \"stuff\" on the walls and good food - this place delivers on all levels.", 4, "pos"], ["Ok I admit I love this place! Best burgers EVER!  They are in business for their clients Only wish I lived closer.", 4, "pos"], ["The Vortex is the giant skull with red-streaked eyes and giant mouth (the entrance) located in the heart of Little Five Points, the Bohemian", 4, "pos"], ["This just might be the very best Cajun joint outside of South Louisiana and Mississippi It is not all traditional Louisiana cuisine.", 4, "pos"], ["A favorite closer to home for us The shrimp ooh la la over angel hair pasta transports you to New Orleans.", 5, "pos"], ["This was our second visit & enjoyed it as much as the first Cute place with great energy in an older town with southern charm.", 4, "pos"], ["Finding an exciting, authentic restaurant can be a daunting task; however, downtown Acworth has a locally owned eatery that fits the bill li", 3, "neg"], ["This is the standard for Cajun food in the state of Georgia.", 4, "pos"], ["I think everyone has pretty much summed it up  They just have a great assortment of really good burgers.", 4, "pos"], ["The vortex is a great place to be with some friends and beers.", 4, "pos"], ["Yummy, beefy, juicy burgers The salad was decent, but this is not the place for salad There are some accessibility issues.", 3, "neg"], ["Walked in to a big wooden penis and a bunch of porn on the walls Walked out Low class place No disrespect to them.", 1, "neg"], ["Although there was a 45 minute wait, because of the Valentine Day weekend, it was more than worth it.", 4, "pos"], ["Service was amazing quite the place where you can sit next to people and carry on a conversation pizza was absolutely perfect crispy yet che", 5, "pos"], ["It's a cool place, not that fancy, but who cares when you taste the best pizza in town! The dough and the combination of flavors is really g", 4, "pos"], ["Best pizza I have ever had plain and simple   Quality ingredients served in a rustic cafeteria like atmosphere.", 5, "pos"], ["My Love and I went last weekend and tried the Margherita THE best pizza we ever had.", 5, "pos"], ["We generally do not like Pizzas in the US Too much cheese for our liking and somehow it just doesn't gel with us.", 4, "pos"], ["I like the diner  I had the twin filets, very good flavor  I like the wedge salad also  The mac and cheese tots are good too.", 4, "pos"], ["I can microwave canned soup at home, save time, money and I might actually put some spice in it  Incredibly disappointed.", 1, "neg"], ["When my husband and I were looking for a greasy and hearty breakfast place we decided to try this diner.", 3, "neg"], ["This place was just a fun place to dine!   All the staff were super nice  Our server was so personable and on the ball the whole time.", 4, "pos"], ["Excellent place and experience! We ordered their grilled cheese vegetable melt and chicken sandwiches.", 4, "pos"], ["The food was yummy The service, when eating at the bar, was horrendous!!! It was a battle to get a wine list and menu.", 3, "neg"], ["This place is great! Our group tried a variety of dishes and shared, everything was perfect Our service was amazing.", 5, "pos"], ["Really good Fried Goat's cheese was awesome Server Travis was phenomenal and very informative and funny.", 4, "pos"], ["I had the pasta Tagliatelle with ribbons of fresh squash and herbed bread crumbs It was loaded with garlic and shallots Delish.", 5, "pos"], ["Our waiter \"Mike\" may have been the best waiter I have ever experienced.", 5, "pos"], ["Good place to have Brazilian BBQ Fogo De chao is good place to have  Espetadas,  and BBQ is good Gr88 place to hangout.", 3, "neg"], ["Was in buck head staying for an football game and one night decided to dine at fogo de chao and it was phenomenal, you will never leave this", 5, "pos"], ["Went for dinner on July 4  The atmosphere was calm and the food was delicious I was told to bring my appetite and they were correct.", 4, "pos"], ["Definitely a place to take a visitor!  The salad is fully stocked with the freshest veggies, the best of the best & the size of the beets, t", 4, "pos"], ["Went there couple of years back Never been to such a great place before.", 4, "pos"], ["A really cool location with an outstanding bar.", 4, "pos"], ["Went there for dinner with family This place has an amazing ambience and peps you up.", 4, "pos"], ["Great Food , wonderful atmosphere  It's easy to see why this place is an institution.", 4, "pos"], ["Salmon chips .", 5, "pos"], ["Went for the firs time Liked the crowd and planning to take family and friends there Great food and quick service.", 4, "pos"], ["Amazing every time we go! Friday night until they run out is the best fried chicken I have ever tasted, and Iâ\u0080\u0099m from the south! One of my ", 5, "pos"], ["This place is really awesome The servers take really good care of you and they are friendly Oh yeah, the food is awesome too.", 4, "pos"], ["The food was fantastic!  The ambience was beautiful, the seating was cozy and not too cramped The decor was crisp and quite lovely.", 5, "pos"], ["Perfect farm to table and cute location just east of downtown.", 4, "pos"], ["What a great restaurant and fantastic atmosphere.", 5, "pos"], ["Very disappointing.", 2, "neg"], ["It's good for what it's worth The food was good and cheap and the restaurant it self was very nice and clean Simple southern food.", 4, "pos"], ["Took a Lyft out here after reading about how great the fried chicken was At 8pm on a Sunday night, the place was packed.", 5, "pos"], ["We had several recommendations to try this restaurant out, so during a recent visit to Atlanta we did.", 4, "pos"], ["Went to a retirement celebration, hadn't been in a while, the food is always delicious!  Our server Brandon was excellent! He anticipated ou", 4, "pos"], ["Anytime I'm in Atlanta or anywhere nearby, I will make the trek to eat here.", 5, "pos"], ["Food was incredible  Great flavor a and good ambiance  But, pretty sure the server forget to hit send.", 4, "pos"], ["After reading some of the other most-recent reviews I was a bit hesitant regarding Leon's and attended a small dinner party of 8 last night ", 4, "pos"], ["Trendy gastropub in the heart of Decatur's foodie mecca This place is hip, clean, and comfortable.", 4, "pos"], ["Great food Great atmosphere Great location Definitely a favorite place for us to go.", 2, "neg"], ["TOURIST TRAP! All hype and no substance Despite having a reservation, we had to wait 45 minutes past our reserved time before seating.", 1, "neg"], ["If you're craving delicious seafood, I'd recommend Atlanta Seafood Market  Service and food were both outstanding.", 5, "pos"], ["A very pleasant experience  The host was very polite and sat us at spacious table at the windows.", 4, "pos"], ["Sushi was served quickly Service was good Fish didn't taste fresh Rice was improperly prepared, lacked flavor.", 3, "neg"], ["Went for a late dinner since we had a large gift card and we're downtown with the kid this place never disappoints.", 4, "pos"], ["Loved the food ð\u009f\u0098\u008að\u009f\u0091\u008d great ambience and service Great spread of menu Little bit on the pricier side but worthy place to eat.", 5, "pos"], ["Just Horrible! Worst service, bad atmosphere, lack of management,and so so food The place is chaotic No order of any kind.", 1, "neg"], ["Relaxing Place Good food and excellent service.", 2, "neg"], ["Really enjoyable We took our son and his fiance to Eclipse de Luna recently We shared two appetizers, exquisite tuna and calamari.", 3, "neg"], ["Amazing but no Samba Amazing place My husband and I always love to go once a month or so on saturdays.", 4, "pos"], ["Two words - Quality food Its a bit on the expensive side but the food is worth it.", 4, "pos"], ["Eh, this place was okay I went a few years back for a friendâ\u0080\u0099s birthday and I remember having the salmon sliders.", 3, "neg"], ["The combo tacos (catfish, shrimp & calamari) were fantastic and the crab cake sliders were so good too Loved the atmosphere Good service.", 5, "pos"], ["One of my favorite restaurants downtown The atmosphere is just my style, good food, beers, and rooftops.", 4, "pos"], ["Great food! We love craft beer and they have a lot of choices Also, specialty drinks if you like that.", 4, "pos"], ["Visited the Marietta Diner for the first time the other night and had an okay experience.", 3, "neg"], ["Marietta diner has a menu that could take a year to eat your way through  What's more, many of the options involve large portion sizes.", 3, "neg"], ["The Marrietta Diner  undoubtedly one of the Best restaurants in the Atlanta area The service has always been good.", 5, "pos"], ["With a shiny, chrome exterior and a warm chestnut interior, The Marietta Diner serves pancakes at midnight, or pasta for breakfast, possibly", 3, "neg"], ["I wish I had a Zomato account a couple of years back when I frequented this place.", 3, "neg"], ["I love this place it's the best hands down They have the best food with the best prices I'm going to try to come more often.", 4, "pos"], ["Everything here is perfect: food is fresh, first-rare even for a foodie town, and the ever-changing beer selection that features local offer", 5, "pos"], ["Absolutely love this place - they have Boddingtons on tap - what's there not to like? I also recommend the chili (served in a boule of bread", 4, "pos"], ["I can't even count on both hands how many time I have been here This is one of my favorite haunts around.", 4, "pos"], ["We stopped at Brick Store Pub on our way down to the Georgia Dome to see a Falcons game.", 4, "pos"], ["Smokey little barbecue joint, with a band of local musicians, the menu is handwritten on the wall, very casual atmosphere, great smoked ribs", 4, "pos"], ["Excellent ribs and Brunswick stew Prices was also good for the quantity and quality of what we got.", 5, "pos"], ["Awesome ribs, amazing potato salad , delicious cole slaw and the collard greens are so good Everything was on point .", 5, "pos"], ["I'm from New England, so finding amazing seafood is not difficult What is VERY difficult to find though, is mouth watering barbecue.", 4, "pos"], ["Fat matts is a trendy eatery in atlanta in a vibrant fun area of atlantavery safe and cosmopolitan.", 4, "pos"], ["Perfect french patisserie at the outskirt of SF.", 5, "pos"], ["Artisan bakery shop in San Fransisco, there is no signage of it but you could easily find this place by looking at line of people at the fro", 4, "pos"], ["Banana cream tart is bomb The chocolate, caramel and whipped cream are perfect together with the flaky crust.", 5, "pos"], ["Its evenings like this that make it enjoyable to go out and spend money on a meal and drinks.", 5, "pos"], ["Exactly as it should be  A true bakery  I pretended to buy something for all 4 of us but ended up on splitting it all with daughter.", 5, "pos"], ["The line is spanning all the way out to the streets but its totally worth it!! Amazing breakfast, pancakes, all types of eggs Benedict and s", 5, "pos"], ["This place was strictly average bordering below average.", 2, "neg"], ["Pedi crepe de chocolate e gostei imenso Recomendo sem duvida este estabelecimento para um Ã³ptimo pequeno-almoÃ§o.", 4, "pos"], ["If you are a fan of breakfast like I am, this is the perfect place to come.", 4, "pos"], ["A cute restaurant situated on a corner serving up various breakfast foods My husband had the crepes, which were great.", 3, "neg"], ["My husband and I decided to have our Anniversary brunch at Greens a couple weeks back.", 2, "neg"], ["Expensive however delicious food It is a delight for vegetarians.", 4, "pos"], ["A quick search on Google for the best vegetarian restaurant in SFO led me to Greens.", 4, "pos"], ["The first thing you notice about Greens is the beautiful dining room with giant wood sculptures and a stunning view of the Golden Gate Bridg", 5, "pos"], ["Our favorite restaurant, drove a couple hours out of our way heading north from Monterey Bay to visit again.", 5, "pos"], ["Not really sure what the hype is about Bland tasting patty and the bun sticks to the teeth We tried the fries and we weren't impressed.", 3, "neg"], ["So after hearing all the fuzz about in n out on internet and how much it is recommanded when in California, we had to try it excitingly, we ", 2, "neg"], ["i think it's a bit overrated, the burger was pretty mediocre honestly - it's more hype than anything else.", 3, "neg"], ["Fast food, fresh, friendly staff, and a great location near pier 39 in a great part of San Francisco.", 5, "pos"], ["Burger was very average My bun was hard  We couldnâ\u0080\u0099t get a seat itâ\u0080\u0099s very busy Recommend to get it to go.", 2, "neg"], ["Indeed they serve the best prime rib! The place is very nice and cozy! We celebrated my husband birthday here and he enjoyed the food so muc", 5, "pos"], ["The food her is AMAZING! Obviously it is called the House of Prime Rib, but this restaurant has a variety of meats.", 5, "pos"], ["This is a must try! The prime rib was delicious! Their arenâ\u0080\u0099t very many menu options but you come here for the Prime Rib! Waits are long i", 4, "pos"], ["This is what I had which is English Cut which is 12 ounces and a baked potato with bacon and chives and sour cream it was abousolultely deli", 4, "pos"], ["Excellent meal  I love Prime Rib and this was arguably the best I have ever had  Better than high-end chain locations (Mortons, etc).", 5, "pos"], ["Food was delicious  Many new and impressive flavors   The lamb chop was extremely tender  Service was decent.", 5, "pos"], ["One of the best restaurants I've been in a really long time! We greatly enjoyed the food & drinks, ambiance and wonderful service! Can't wai", 5, "pos"], ["This place is neat, just such a cool space like I've never seen.", 4, "pos"], ["It was all good Food was very flavorful , atmosphere was great Outdoor seating is the way to go if you are given the choice.", 4, "pos"], ["The facade of the restaurant can be misleading and, perhaps, even underwhelming - a set of retro cinema doors with run-down buildings surrou", 5, "pos"], ["Chouette resto, bouffe excellente, serveuse agrÃ©able.", 5, "pos"], ["Had to wait for almost an hour just to get in due to the long waiting list for lunch It was definitely worth it.", 4, "pos"], ["We woke up early to secure a table on Saturday after learning that Eater considered this one of the \"essential brunches of San Fran\".", 4, "pos"], ["This restaurant gets a 4.", 4, "pos"], ["Its evenings like this that make it enjoyable to go out and spend money on a meal and drinks.", 5, "pos"], ["What a fantastic restaurant.", 4, "pos"], ["Visiting SF from NC This was very unique and the best food I can remember  Get there early It was a long wait on a Tuesday.", 5, "pos"], ["Love the yum cha/dim sum approach, as it allows you to actually see a lot of the dishes before choosing them.", 3, "neg"], ["Food was amazing - waiters walking various appetizers around meant you got food quickly and often and by and large everything was excellent ", 4, "pos"], ["This place came highly recommended, so like good little tourists, we went early and queued up.", 3, "neg"], ["Iâ\u0080\u0099m always a fan of a good ice cream Sunday So I ordered a warm brownie Sunday in honour of international brownie day It was 13$.", 2, "neg"], ["Super fun service Amazing ice cream and chocolate  Amazing Ice Cream sundaes!  They are so large .", 5, "pos"], ["Had a chocolate indulgence here with the Banana Split So creamy, so full of hot chocolate sauce.", 4, "pos"], ["Full marks for the location - there is no greater joy than relishing warm gooey brownies (yes, plural) by the water.", 5, "pos"], ["Best chocolate dessert everJust loved itParadise for chocolate loversWe had a sundieIt was yummy.", 4, "pos"], ["First things first: the food is that amazing Delicious hot steaming clay pot with a great selection and size of ingredients.", 3, "neg"], ["We toured San Francisco on a big bus and when the tour guide said George Lucas frequents this place, the fan boy in me just had to try the p", 4, "pos"], ["Very unassuming restaurant from the street side however when you step downstairs, it's busy and buzzing! Decor a bit dated and service is no", 4, "pos"], ["Delicious chinese food in SF chinatown Service is typical of overseas chinese restaurants around US But food is really really tasty.", 4, "pos"], ["One of best Cantonese restaurant I have been to Authentic, fresh, delicious! Food are served quick, but service is okay.", 4, "pos"], ["On the top of Macyâ\u0080\u0099s in Union Square, this place has a amazing view and atmosphere.", 4, "pos"], ["Great food Big serving!!! Nice place to hang out, al fresco! Took us a while to get in but its fine.", 5, "pos"], ["This place is always packed Get there early (5pm or 5:30pm for dinner) or expect a looong wait for a table.", 4, "pos"], ["They serve awesome cheesecakes All the dishes too are full of cheese as the name also suggests.", 4, "pos"], ["Located in one of the top floors of Macy's busy shopping mall, i found it a bit hard to find.", 4, "pos"], ["Greattt food!! The clamchouder is not to be missed The pizza is good and their bread is very good.", 4, "pos"], ["Really enjoyed the place!! Although the place was packed, they have a nice system to get things moving.", 4, "pos"], ["Such a cool place to visit! You can watch the bread making process through a window The lines move quickly and the food is pretty good.", 5, "pos"], ["This was one of the oldest bakery and there are so many bread options.", 4, "pos"], ["We came from breakfast and had crab egg Benedict It was ok, you can get same or even better anywhere.", 3, "neg"], ["Quite good, but not nearly as amazing as I thought it would be.", 3, "neg"], ["Delicious Vietnamese in the Ferry Building well suited to groups given you can order 'family style' and the more the merrier if you can then", 4, "pos"], ["Fast serviceÂ  Good food.", 4, "pos"], ["This is restaurant that I have come to every time I am in San Francisco and never order any food.", 3, "neg"], ["The food is great Delicious fresh and yum ! We loved it , the restaurant is located at ferry building .", 4, "pos"], ["I have never eaten better home made ice cream than this ! Its simply amazing.", 4, "pos"], ["Great artisanal ice cream.", 5, "pos"], ["Not sure why there are such huge lines outside of this place all the time, but I have no complains about the quality of the ice cream either", 4, "pos"], ["The Best Homemade Ice Cream in San Francisco! Delicious and Unique Flavours - Worth the Wait in Line!Â   I discovered Bi-Rite Creamery on my", 5, "pos"], ["Bi-Rite Creamery is just around the corner of Dolores Park   Their other location is located on 550 Divisadero St.", 4, "pos"], ["This place was about a 15 minutes walk from where I was staying over the summer for my internship, so I decided to give it a try because of ", 2, "neg"], ["Came highly recommended- and on my recent visit to SF I had to try it out, got in early and got a table without having to wait, though the p", 4, "pos"], ["Waited an hour in line and it was mediocre at best.", 2, "neg"], ["Staff were polite but the pancake was hard and dry Wait time was over an hour Highlight was the smoked chicken & apple sausage.", 3, "neg"], ["Worth the wait Don't go in a large group as it adds to the wait time Service was excellent.", 4, "pos"], ["Amazing little pizza place - the pizza dough is so light and crispy! Also had the saffron arancini to start, which were awesome.", 4, "pos"], ["Its evenings like this that make it enjoyable to go out and spend money on a meal and drinks.", 5, "pos"], ["Not a pizza fan but on this SF trip, I got to try both Delfina and Una.", 4, "pos"], ["I apologize as a recent New Yorker, but I don't get what the hype is about here.", 3, "neg"], ["Outrageous Food Had two different Pizzas with the kids some sodas and Wine for Dad (they are hard to please).", 3, "neg"], ["Tucked away in Pier 47, nice ambience and some really charming waiters in the place The food is also very good.", 4, "pos"], ["Divine! The atmosphere and views from most tables is nice The food is amazing.", 5, "pos"], ["Always great, must stop whenever in San Francisco  Gives you the feel of old school NYC Italian, except seafood.", 5, "pos"], ["Fresh and delicious food, nice and friendly staff a wonderful place to be I recommend it , only the price .", 4, "pos"], ["Stopped in without a reservation for lunch on a Sunday; had a bit of a wait at the bar, but wonderful Bloody Mary's served.", 4, "pos"], ["1 saatlik bekleme suresine kesinlikle degen Zuni Chicken mutlaka denenmeli Porsiyon oldukca buyuk, 2-3 kisi yiyebilir.", 4, "pos"], ["Piyano ve insan seslerinin uÄ\u009fultusu fazlaydÄ± Bunun dÄ±Å\u009fÄ±nda yediÄ\u009fim kÄ±zarmÄ±Å\u009f bÄ±ldÄ±rcÄ±n Ã§ok lezzetliydi.", 4, "pos"], ["Test Test", 4, "pos"], ["Food was very good, but atmosphere is horrid Very loud and uncomfortable seating.", 4, "pos"], ["Great Service!! (party of Six) We managed to snag a window table for our party and were waited on by a true professional waiter.", 2, "neg"], ["A restaurant focused on garlic was my friend's poison of choice, it will put me to the test on how much I really do love garlic.", 3, "neg"], ["You gotta go here onceif you like garlic! Small and homey, great kind waitstaff.", 3, "neg"], ["Best food i've had so far Perfect blend of garlic with everything available, it was subtle but still stood out in every dish served.", 5, "pos"], ["One word Touristy! And I am a tourist Decent food with an overload of garlic which is what the restaurant is all about.", 3, "neg"], ["Against my better judgement I visited this tourist trap The wait was long, the place was packed and noisy The service seemed rushed.", 3, "neg"], ["This is our second visit to this San Francisco landmark.", 4, "pos"], ["Man oh man, where do I even begin *O*  Upon arriving, we were seated promptly at a table side-by-side.", 4, "pos"], ["We had the pleasure of eating here tonight We luckily we got the reservation same day The restaurant was packed Staff was amazing.", 4, "pos"], ["Gary Danko has been a standout in San Francisco for many years, and it's still necessary to plan two months in advance for a reservation.", 4, "pos"], ["I LOVE Gary Danko!  I have been 4 times, and every time it is a wonderful experience! I like variety, so I love the make your own menu feel ", 4, "pos"], ["Busy place that has a great vibe The cocktails are great and the food is fresh and tasty.", 4, "pos"], ["Located on 3rd Avenue, Wild Ginger serves Vietnamese and Chinese fare with a fine dining experience The ambience is very beautiful.", 4, "pos"], ["Grabbed a meal here whilst in Seattle on a business trip.", 3, "neg"], ["Not a bad Thai place.", 3, "neg"], ["After searching for chinese style food at Pike & going wrong a few times we hit this place& boy oh boy were we pleasantly surprised.", 4, "pos"], ["Really cute place and we were really looking forward to coming here as they have a meat and cheese menu with chef selections.", 3, "neg"], ["Nice cocktail - Cap Martin I went there for dinner And I had the tuna It was really great The fish was cooked just right.", 4, "pos"], ["Great staff, great food, great setting! I had the roasted quail - no complaints Good wine selection.", 4, "pos"], ["Had a nice dinner The starter was a bit small and boring in presentation although the pates were good.", 3, "neg"], ["This is an OK place for breakfast (at best) They had limited options for non pork eaters.", 3, "neg"], ["What an amazing happy hour !!! $4 mussels (loaded bowl in a jalapeÃ±o cilantro cream sauce) and $150 oysters.", 4, "pos"], ["I loved the food in this place so much we went back again the next night - (second time around food was just as brilliant but the service wa", 5, "pos"], ["The best and freshest oysters I had ever had in my entire life.", 5, "pos"], ["Amazing service by our server Tom, great food that came fast He had great suggestions from the menu and was very helpful.", 5, "pos"], ["Oh my gosh! Really awesome! The oysters is really fresh and make you want to eat more.", 5, "pos"], ["Spent the day in Seattle and this was a wonderful way to wrap up our stroll at Pike Place Market.", 3, "neg"], ["I'm thinking of booking a flight back to Seattle just so I can get my hands on another smoked salmon pate from Piroshky Piroshky.", 5, "pos"], ["Long running Russian bakehouse serves the best baked goods in the Pike place area.", 4, "pos"], ["The search for first Starbuck store led us to Piroshky Piroshky And the long awaited Starbuck pushed us closer to this establishment.", 4, "pos"], ["Given Piroshky Piroshky and Starbucks started on the same street it makes absolutely no sense that Starbucks has 10,000 times more stores.", 4, "pos"], ["wiwiwowfewofwocncowncwocnwocnwocnconwoncowcnenwonwcdwncldnldnllsd msdm c slclcndslcnslcnslcsllsnclsn lcldsnlnsln192102901921029109 232832hfo", 3, "neg"], ["Very uniqueÂ and good environment and awesome location I eat best New York up there.", 4, "pos"], ["Well-composed crab and scallop dishes Avoid spicy preparations if you want to taste the subtle sweetness of the meat.", 4, "pos"], ["This restaurant offered first not only a great value three course meal for $41 (outstanding value) but the majority of items in the menu wer", 4, "pos"], ["Friends of ours brought us to this unique restaurant I couldn't decide if it was more French than Spanish.", 4, "pos"], ["Quite possibly the best chowder ever !! The line up was long (behind us anyways) once it opens at 11 it goes fast though ! We ordered a larg", 5, "pos"], ["Did you really visit Seattle if you didn't try Pike Place Chowder? I think not!Â Â   Due to the restaurant's popularity, I was expecting the", 5, "pos"], ["Well you just can not beat their chowder can you!  We had the famous clam and also a smoked salmon chowder - this is another place we went b", 4, "pos"], ["Hunting down Pike Place Chowder was an adventure in itself.", 4, "pos"], ["New England Clam Chowder & Seafood Bisque & Seared Scallop Chowder & Lime Coconut Chowder ð\u009f\u0094\u0086â\u009d£ï¸\u008f I went there around 10:30, but there we", 5, "pos"], ["Very impressive brunch in the heart of Seattle Â I had the duck hash, and the contrasting flavors and textures were on point.", 4, "pos"], ["Excellent meal at the Dahlia Lounge recently We sat at the bar, as the restaurant was full.", 4, "pos"], ["One of Tom Douglas' many restaurants in Seattle serving  up interesting dishes with a twist.", 4, "pos"], ["On point.", 5, "pos"], ["Bljmsmith Wonderful place! Great service The food was beautiful, and was such a great experience of delightful flavors.", 3, "neg"], ["Omg!   Delicious sandwiches!   Staff is great too  Nice mix of music without being too loud  Great place.", 5, "pos"], ["Have been many here many times since moving back to Seattle The sandwiches are awesome, the fries and slaw are also definitely on fleek.", 3, "neg"], ["The Fast Eddie with a jus is my SOLID go to! The staff with their quirky appeal may take some getting use to, but once you become a regular ", 4, "pos"], ["I LOVE THIS PLACE! It proves the goldilocks effect to be all too true.", 5, "pos"], ["Great Place, good coffee, nice fresh sandwitches", 4, "pos"], ["Matt's in the Market was delicious and a beautiful space with a great atmosphere The estimated cost that is listed is not even close.", 4, "pos"], ["It is crazy to me how this restaurant isn't rated five stars by everyone.", 5, "pos"], ["Spirited and quite special Matt's was at the top of my to-try list for this trip to Seattle and there was no disappointment.", 3, "neg"], ["Awesome lunch value! Been here for lunch a couple of times.", 4, "pos"], ["Great food, once again First time eating there in a few years, and the seafood is excellent.", 4, "pos"], ["Heard a lot about this place before going there Serious pie is known for its selection of wines and pizzas.", 4, "pos"], ["We had a late night meal here on our first night in Seattle, and it did not disappoint.", 4, "pos"], ["Stopped by  during happy hour All pizzas were $6 half size Our family of four tried a different one each.", 5, "pos"], ["Good pizza, needs more options and definitely not authentic Napolitano pizza Expensive for what you get.", 3, "neg"], ["The service was great! We had a wonderful table by the window Those are the best compliments I can give.", 2, "neg"], ["I've been to Lola 3 times A joint by chef Tom Douglas, the ambience is great They have a rotating menu each month.", 5, "pos"], ["Beautiful space to have an intimate breakfast.", 5, "pos"], ["Good place for breakfast The Greek scrambled eggs were just fantastic And the garlic potatoes were to die for.", 4, "pos"], ["Waited here for our table at Serious Pie across the street (highly recommend!).", 4, "pos"], ["I was definitely recommended this place Specially the chicken and salmon kebab perfectly cooked and they were all delicious too.", 5, "pos"], ["Nice! Nice! Nice! The place is hard to find and easily to miss But the pink door is cute and eye-catch.", 5, "pos"], ["Quaint place in downtown Seattle.", 4, "pos"], ["Such a fun place!! Only marked with a plain pink door, excellent food, there was an acrobat for entertainment.", 5, "pos"], ["As always this place gave me good time, good food, I really enjoy come here for a romantic dinner, you guys are doing it great, everything i", 5, "pos"], ["The Pink Door was recommended by a work colleague, and it's a good thing because I never would have found it on my own.", 4, "pos"], ["My favorite bakery in west seattle! Everything I try here is just simply delicious- be it savory or sweet.", 5, "pos"], ["Twice baked almond croissant is the best I've ever had Been there multiple times and it lives up to my expectation each time.", 5, "pos"], ["This is one of the top three bakeries we visit  Excellent all around from the sandwiches, pastries, cakes.", 5, "pos"], ["I personally live this place Be it for breakfast or lunch We tried several pastries and pizza All were fresh and really tasty.", 4, "pos"], ["Consistently delicious and gorgeous presentation Well staffed and efficient considering the long lines on the weekends.", 5, "pos"], ["This was an excellent meal! We sat outside and didnâ\u0080\u0099t get as much of the swanky atmosphere and still left very happy.", 5, "pos"], ["I'm amazed that someone else ordered the Dungeness crab, seaweed noodle, and spicy red curry dish and didn't love it as much as I did.", 4, "pos"], ["I stopped in to Revel for lunch on a Friday afternoon after reading the reviews for a good amount of time.", 3, "neg"], ["I had lunch here yesterday.", 3, "neg"], ["Dungeness crab, seaweed noodle with spicy red curry was one of the best noodle bowls I've ever tasted.", 3, "neg"], ["What can I say - the best fish and chips I have ever had.", 4, "pos"], ["To start out our food was delicious and the atmosphere was wonderful, but with that being said, our server and overall experience were terri", 2, "neg"], ["Hands down, one of the best place for sea food look at the size of the trout double the size of my head.", 5, "pos"], ["This is a great fish restaurant  I had the Fish & Chips  It was made from Alaskan Ling Cod  It was delicious.", 4, "pos"], ["Located right in front of the Pike Place Market, Steelhead Diner is a nice restaurant to get some Pacific Northwest fare.", 4, "pos"], ["Yummy looking, difficult to choose which one to try for my first Top Pot Donuts.", 3, "neg"], ["I had their raspberry and chocolate doughnuts I wish they were softer.", 4, "pos"], ["Wohoo, this is one place where i can go anytime even with full stomach.", 4, "pos"], ["Exceptional donuts, ideal for breakfast The donuts are actually one of the best I've ever had Coffee and donuts is the way to go here.", 4, "pos"], ["the interior has an interesting wall of books comfy ambienceÂ   i ordered caramel donut, double trouble cake and a latte.", 4, "pos"], ["Amazing breakfast options! The place seems to be always very crowded.", 4, "pos"], ["Go to Portage Bay I am a college student so let me say for my budget this place is a special occasion type of place.", 2, "neg"], ["Majorities.", 3, "neg"], ["The Only Place You Need To Go For Brunch Holy French Toast! This place knocks my socks off every time.", 3, "neg"], ["Great For Breakfast A friend recommended this place to me for breakfast I have been there a couple of times and was really happy.", 4, "pos"], ["This was my husband's and my first visit to Seattle, and he was so sweetly excited to try this brunch place after reading the good reviews o", 1, "neg"], ["My frequent trips to Seattle now consist of trying out new brunch spots This one came up on a random search and it didn't disappoint.", 4, "pos"], ["There are some interesting things to try in hereÂ Â  But I always default to a burger and a shake.", 3, "neg"], ["We snuck in here around brunch time The place was very busy so it was not too much sneaking.", 4, "pos"], ["Had a solid chicken sandwich here It's good, it's clean, it's pretty much everything you're looking for your basic dining experience.", 3, "neg"], ["Worse part was finding a parking spot - but, there is a lot behind the building if you can't find anything on the street.", 4, "pos"], ["If you're looking for a great sandwich in Seattle THIS is the place.", 4, "pos"], ["Great Experience On a visit to Seattle, I got there early and sat at the door waiting.", 4, "pos"], ["Muffo It doesn't get better than this Incredible! Meat melts in your mouth.", 3, "neg"], ["Great sandwich! Salumi was a breath of fresh air in regards to dining out.", 4, "pos"], ["Awesomely fresh and delicious food We were here on a Monday night and the salmon was the BEST I have ever had.", 5, "pos"], ["Located on 4th ave and University, it as a unique interior, we really enjoyed the atmosphere.", 4, "pos"], ["My mom and I were in from out of town and stopped here before a symphony concert.", 5, "pos"], ["Excellent, excellent cafe and wine bar! I was exploring downtown yesterday to look at a Star Wars inspired gingerbread village and the downt", 5, "pos"], ["Every time I've been to Purple the service has been outstanding and the food had been delicious.", 5, "pos"], ["Went for breakfast on a Sunday morning right when they opened and there was already a line! So get there right on time if you want a table! ", 4, "pos"], ["This seems to be a little local chain  The menu has a varied selection from Burgers to lobster risotto.", 4, "pos"], ["Honestly, I had a huge expectations about this place and I took my guests there for breakfast It was my first time dining there too.", 2, "neg"], ["Loveeee everything about this restaurant! My family and I went here for brunch and it was the right choice! The food was delicious and price", 5, "pos"], ["Amazing place to have breakfast.", 4, "pos"], ["Here I go with my old building obsession.", 5, "pos"], ["Terrific place! Went there on a Friday night and it was packed.", 4, "pos"], ["This place was hopping even on a Tuesday night We did not have a reservation and ended up eating at the bar (1 of 4!) along a rail.", 4, "pos"], ["Amazing restaurant in the heart of DC just a block behind white house Their specialty is oysters.", 5, "pos"], ["This place is the classy late night spot I've ever been to It's beats the hell out of Waffle House at 2am.", 4, "pos"], ["Ambience is good I had crab which was really delicious Service was good and its on the downtown and near the capitol arena.", 4, "pos"], ["Authentic Spanish food.", 3, "neg"], ["Food was fresh, but not much flavor  The atmosphere was great and casual  I would come back, but wish the flavors popped.", 3, "neg"], ["The food and drinks were well done but what I really enjoyed about Jaleo was the dining experience Trying new small plates.", 4, "pos"], ["Walking distance from the hotel, I wanted to try something different for lunch vs the onsite bar & grill or the burger joint across the stre", 3, "neg"], ["Excellent spices and flavors in the food Very attentive staff.", 5, "pos"], ["We are stumbled upon this place and we are so happy we did.", 4, "pos"], ["We stumbled upon this place and we are so happy we did.", 5, "pos"], ["Undoubtedly, the best Mediterranean food in town! The drinks are good as well The service can be really slow during rush hours.", 4, "pos"], ["Zaytinya will not be a satisfying experience for Turkish people who live in DC.", 3, "neg"], ["Really good food and service Too bad we'd had pizza earlier in the day, but the drinks were great at the bar and the food was very good.", 4, "pos"], ["I've been here a couple times and the food has always been good! I'd highly recommend the arancini, to my favorite thing on the menu! More o", 4, "pos"], ["This may be the best wood fired pizza in DC.", 5, "pos"], ["Called ahead for seating reservation  Wait was 25 minutes Arrived as directed and got pager to wait for an additional 10 to 20 min .", 3, "neg"], ["We got the crab and avocado tower at the waiters recommendation and it was really good and light just as it was promised to be.", 5, "pos"], ["The Elvis cupcakes and hot chocolate and coffee can make your day.", 4, "pos"], ["Really nice food! Went there twice during our stay in DC and will be back next time! Atmosphere is very cozy.", 4, "pos"], ["This is one of my most favorite places in Washington DC The place is very cute and really fancy They have some of the best baked cakes.", 5, "pos"], ["Great Place to visitÂ  Awesome foodÂ  Little bit of a wait, but it was worth itÂ  I cant wait to visit them again.", 4, "pos"], ["The cupcakes were amazing not too sweet and not too much icing just enough and the drinks were really good as well.", 5, "pos"], ["Classic DC spot! Its simple Its great! Its cheap! Make an effort to come if your in town.", 4, "pos"], ["This place has been on my must do list for the last 5 years It didnâ\u0080\u0099t disappoint I got the half smoke.", 4, "pos"], ["Fast Cheap Good The best chili dog I've ever eaten.", 4, "pos"], ["I've eaten at Ben's countless times while studying in DC, the food here is consistently fantastic and you never leave disappointed.", 5, "pos"], ["\"Every taxi driver knows Ben's Chili Bowl\", sure enough our taxi driver didn't bat an eye.", 4, "pos"], ["Awesome place to grab breakfast! Â Everything was perfectly done Â We also ordered some homemade pop tarts to go.", 5, "pos"], ["Fresh poptarts and one of the most authentic American restaurants in DC Everything is freshly made in the morning and smells heavenly.", 5, "pos"], ["The food was good, but thought it came out pretty quick, making me wonder if a lot of it is pre prepared.", 4, "pos"], ["The atmosphere within Ted's is very nice and refined with the bakery and desserts in the front and the tables in the back.", 4, "pos"], ["If you like your burger big and juicy with a toasted bun and savory fixings, this place is for you.", 4, "pos"], ["If you are a real carnivore this place is heaven for you Best way to taste all different types of brazilian meats.", 4, "pos"], ["Great seleaction of salads  Lunch was $15  Service was spot on and so fast  The BBQ portion would be expensive for lunch.", 4, "pos"], ["Great experience and compared to service and quality you get the price is also fair.", 4, "pos"], ["Fogo de Chao is the best of the high end Brazilian Steakhouse chains.", 4, "pos"], ["I'd always wanted to try a Brazilian steakhouse and my husband finally relented on this DC trip The service was absolutely great.", 4, "pos"], ["Creative and delicious A friend and I came for lunch during restaurant week.", 4, "pos"], ["Very nice ambiance, lively environment No parking of course Fast service, a bit pricey Leas option for chicken lovers :).", 3, "neg"], ["This is very good Mexican food.", 4, "pos"], ["One of the more authentic Mexican  restaurants They make guacamole right in front of you Their chips are one of the best.", 4, "pos"], ["This was a fun, tasty meal The star of the evening to me was the salted foam margarita That's right Salt in the foam.", 4, "pos"], ["Awesome foodÂ  The french fries were fresh and crispy!Â  The burgers are made right as you order.", 4, "pos"], ["Words can't describe the toasted marshmallow shake Has to be experienced to be truly understand The burger and fries were great as well.", 5, "pos"], ["If you like good burgers and onion rings, this is the place to be.", 5, "pos"], ["Living in VA I travel to DC often and no trip is complete without a Prez Obama Burger from the amazing restaurant.", 5, "pos"], ["One of the best burgers I've ever had Fries are delicious too Very friendly,  very fast service.", 4, "pos"], ["The wonderful French restaurant is well hyped for it's authentic cuisine and ambience.", 5, "pos"], ["Excellent mussels! Especially the chicken and dumplings mussels.", 4, "pos"], ["My so called T bone steak was overcooked, service was slow and not friendly Tables were too small and crowded Very loud ambiance.", 1, "neg"], ["One of the best steakhouses I have eaten Great selection of steaks and grills to chose from.", 5, "pos"], ["Love everything about this place From the service to the food to the decoration.", 5, "pos"], ["A perfect place for avid readers and foodiesWe didn't have to wait too long for our food, and the service was pretty good.", 5, "pos"], ["This is a weird place It's a restaurant at the back of a book store.", 4, "pos"], ["Menu has good variety but not a whole lot of choices  Soho Omelet was very good and hubby liked chicken pot pie.", 4, "pos"], ["Books/food/drinks? Seems like the right combination Kramerbooks is open until very late but it also great for casual lunch or brunch.", 4, "pos"], ["A brilliant combination: books and food I ate fish tacos and a delicious cocktail.", 4, "pos"], ["Food was great, the service was fast and friendly.", 4, "pos"], ["The food was delicious and quick The servers were attentive and friendly I would definitely recommend eating here.", 4, "pos"], ["Service has gone downhill since my last visit  No longer worth the effort of coming here.", 1, "neg"], ["Lauriol Plaza is a popular restaurant near Dupont Circle that's known for it's Mexican cuisine and drinks.", 4, "pos"], ["Don't go solo! POOR SERVICE! I rarely complain about restaurants.", 3, "neg"], ["Came to try this restaurant due to seeing it on the Food Network and hearing about there award winning ravioli.", 4, "pos"], ["Excellent experience Huge portions and authentic italian taste Very hospitable waiters and staff.", 4, "pos"], ["Massive portions, awful decor, extremely busy and very popular and very noisy.", 2, "neg"], ["While visiting Washington we chose to visit the Georgetown area one evening.", 4, "pos"], ["Best Italian meal I ever had Food was amazing -- from Arancini appetizer to the most amazing 20 oz bone-in veal chop I have ever eaten.", 4, "pos"], ["Visited this place today to celebrate the birthday of my friend I must say the place is wisely and appropriately chosen.", 4, "pos"], ["Amazing food and fantastic service  This is an exemplary restaurant  The restaurant decore is above average and we were comfortable.", 5, "pos"], ["Incorporates all basic principles of Indian cuisine- texture, spice, depth of flavour and aroma  The palak chat is a must try.", 4, "pos"], ["Very good food One of the best Indian food I have had outside of Dubai and India The palak chat and dal makhni were excellent.", 4, "pos"], ["EXCELLENT ! Whether it's the taste, the service or the ambience, Rasika scores well on every count.", 5, "pos"], ["Awesome Cupcakes,Â  Just a long wait but its worth it!!!Â  Â Even in the cold its worth the wait.", 4, "pos"], ["Most amazing most delicious cupcakes you can have in town is from Georgetown cupcakes Amazing variety of cupcakes they serve.", 4, "pos"], ["The best cupcakes i've ever eaten.", 4, "pos"], ["The institution to visit There is one on Newbury Street but nothing beats the original.", 4, "pos"], ["Normally I don't like cupcakes, but I really like Georgetown Cupcake.", 4, "pos"], ["The good: -Great selection of food -Consistent quality food for almost a decade.", 3, "neg"], ["FFB is a brunch lovers delightÂ  We arrived at a busy time, 11:00, but we were able to find 2 seats at the bar.", 5, "pos"], ["Delicious and worth the wait  Sat outside on the patio which was lovely OK service, it was on the slower side but it was also very busy.", 5, "pos"], ["What an interesting sister restaurant to my fav- founding farmers! This was my first time dining here and it had a few winners.", 3, "neg"], ["The weekend brunch is amazing Just be prepared to add 10 pounds when you go.", 4, "pos"], ["The pizza was incredibly salty And we ordered three different kinds.", 2, "neg"], ["I was told that 2Amys was one of the best pizza places in Washington and they were not wrong! Whats better than good pizza with good wine in", 4, "pos"], ["This place is overrated  Toppings aren't generous and crust has no flavor  The problem with pizza in DC is there isn't good pizza in DC.", 3, "neg"], ["I heard such great things about this authentic Neapolitan pizza that when my ladies offered to take me out for a birthday lunch this was my ", 3, "neg"], ["This place was awesome, the food great The server, Kevin, if I recall correctly was  even better I felt like at home.", 5, "pos"], ["Gastronomy is only part of the aura of any given enterprise and while this obliquely named location delivers with excellence in that arena, ", 4, "pos"], ["Visited Busboys and Poets for brunch during the weekend and fell in love.", 5, "pos"], ["I stopped in for lunch the other day to find the restaurant quite packed.", 4, "pos"], ["My host on AirBnb kept on telling me about Busboys and Poets since day 1 and we finally went there.", 4, "pos"], ["Love Busboys! This location is my favorite Genius concept of a bookstore and a huge cafe/restaurant.", 4, "pos"], ["Okay NOT the place to go to begin your cleanse or watch carbs The portions are big Not just big Big I had the Fried Chicken Benny.", 3, "neg"], ["Last week I was in San Diego and looking for some place where I can have a delicious food to eat and I went Hash House a Go Go as per my fri", 4, "pos"], ["I've never given a place a 5 but this place was absolutely perfect.", 5, "pos"], ["One of the BEST breakfasts in San Diego.", 5, "pos"], ["I was a bit skeptical based on the name and pictures, but what an awesome breakfast experience.", 5, "pos"], ["So far my favorite restaurant I've ever been to The food was flawless, drinks were great, service exceptional, and view was perfect.", 5, "pos"], ["cozy place with an awsm sea view being here was awsm and was fascinating as well tried some stuffs, were awsm u guyz rock so must be in the ", 4, "pos"], ["View and ambience are second to none, however, I can't say the same about the food.", 4, "pos"], ["Loved it here! This restaurant has a very nice ambience and view! We sat at the top floor at the roof terrace.", 5, "pos"], ["I visited this restaurant with some old friends from my college and the cuisine was simply amazing.", 3, "neg"], ["Richard Blais and his crew are amazing The staff is super nice and very accommodating.", 5, "pos"], ["Overall an outstanding meal that did not disappoint.", 5, "pos"], ["sO WE SHOW UP20 people plus 2 more after about 20 minutes we had a curtained off area, - booked in advance.", 4, "pos"], ["I was super excited to come here and when I did the hostesses were so rude as soon as we walked in the door.", 3, "neg"], ["This is my very first 5-star restaurant review! I've given 5 stars to one bar and one coffee house, but c'mon, that's a much easier scale.", 5, "pos"], ["This place was great The food was perfect The service was outstanding We enjoyed from beginning to dessert.", 5, "pos"], ["Came here while on vacation and honestly this is the best Italian restaurant I have ever been to.", 5, "pos"], ["Top of the line place Very energetic and fun Service was great, ask for Jonathan.", 5, "pos"], ["I just don't get why there is so much hype about this place The food was good but not outstanding.", 1, "neg"], ["I went here for my birthday in 2010 or 2011! It was really good As appetizers my Mom and I got ricotta gnudi.", 5, "pos"], ["Excellent food, feel, and service The line went down the block but it was so quick to get in Well worth it and not expensive at all.", 5, "pos"], ["We tried the original burger with bacon and some onion rings The onion rings were average The burger was decent though and very cheap.", 3, "neg"], ["We went here recently while on vacation in San Diego The service is fast and friendly, and the atmosphere is so cool.", 4, "pos"], ["I was determined to visit Hodad's while in San Diego and am glad my friend and I made the effort Going in, my expectations were sky high.", 4, "pos"], ["The food was amazing.", 4, "pos"], ["Spanish restaurant in the heart if the Gaslamp district Dance show at night Great truffle burger Great hosts.", 4, "pos"], ["The place has a nice atmosphere and good sangria The tapas were okay and the paella meh.", 3, "neg"], ["I haven't had Spanish Tapas in a long time so that may be affecting this review.", 4, "pos"], ["Paella is phenomenal- made from scratch Two of us shared a large paella and small house salad.", 5, "pos"], ["Very good bet in the sometimes touristy Gaslamp The food is delicious and the staff and atmosphere is authentica.", 4, "pos"], ["Great waitstaff and classic wine menu Food was excellent, I really enjoyed the pasta dish I had.", 4, "pos"], ["I definitely enjoyed my experience Definitely a trendy and energetic atmosphere.", 4, "pos"], ["We make reservations each and every time we ae visiting San Diego It has a very impressive wine list.", 5, "pos"], ["We tried the mission figs pizza and the margarita pizza with chicken Both were delicious.", 4, "pos"], ["I ordered the Garlic mashed potatoes, herb chicken and spinach and my mom ordered a cheese ravioli.", 4, "pos"], ["Amazing ambiance and amazing desserts!! We stopped here only for dessert and I wish we would've ate dinner there as well.", 5, "pos"], ["Good selection of food and drinks Cool atmosphere and nice staff also to make the experience that much better.", 4, "pos"], ["I went for lunch and had a turkey panini It was very good For desert I had the blackberry blueberry trifle and it was amazing.", 5, "pos"], ["I think I definitely need to try this place again because I was a bit disappointed with my first visit.", 3, "neg"], ["There's no denying that the good people at Extraordinary Desserts are good at what they do.", 5, "pos"], ["Pros- looks different on the outside Cons- eggs bennidect weren't so great, lacking in flavor, the potatoes were under cooked & Luke warm at", 2, "neg"], ["It's was pretty good I had the Samson's Steak Sandwich featured on Diners Drive Ins and Dives.", 3, "neg"], ["Great fried clams,good beers,and great staff !", 5, "pos"], ["Not very good I only go here in the middle of the night but the service sucks and it has typical crappy diner food.", 3, "neg"], ["Fantastic authentic fried clams! I am a long relocated New Englander.", 3, "neg"], ["A very big restaurant! Recommended by a local friend but a bit disappointed about the food, seems like a very popular place and even needed ", 3, "neg"], ["Great chips and salsa! Their spicer homemade was great too! Enjoyed the Pollo a la crema was very good! Great Cadillac Margarita! I'll be ba", 4, "pos"], ["Old Town San Diego is where you experience the best margaritas and Cafe Coyote is no exception.", 3, "neg"], ["Always a great place to bring visitors to San Diego  Lots of tables and staff make it an easy stop and very good local Mexican food.", 5, "pos"], ["Went here with a family of 8 and was sat immediately Food is good, especially the carnitas.", 4, "pos"], ["Best pizza in town! They have a large selection of great pastas and pizzas We only spent $25 for the 2 of us and got an excellent meal.", 5, "pos"], ["I would rate this place in terms of customer service a 05 star.", 1, "neg"], ["Cool old Italian ambiancethe busy kitchen, average serviceÂ and everything piled tight to each other The food? - meh.", 3, "neg"], ["We came here for our 3 month anniversary and picked this place because of its zomato rating.", 5, "pos"], ["Love the layout, and decorations of this place The food.", 1, "neg"], ["A hidden gem! We weren't sure at first if we had the right place There weren't any signs.", 4, "pos"], ["I don't see any reason not to like Stone Brewingspacious restaurant in a lovely setting serving good food.", 4, "pos"], ["This place is awesome.", 5, "pos"], ["I ate dinner here Sun -had the shrimp and grits The grits were the best part.", 2, "neg"], ["Very good beer and top notch service  The food was good, slightly pricey, but the ambiance and flavours made it worth while.", 4, "pos"], ["Food-â\u009c\u0094ï¸\u008f Service-â\u009c\u0094ï¸\u008fâ\u009c\u0094ï¸\u008f Easy on the pocket-â\u009c\u0094ï¸\u008f  Cashier was super friendly  I had been to San Diego for a conference and this pl", 4, "pos"], ["We were visiting San Diego and this place came up as the best for \"pizza by the slice\" Quite a lot of veg choice Service was very nice.", 4, "pos"], ["So what has happened to Bronx Pizza's crust?Â  I have been a big fan of Bronx Pizza for many years.", 2, "neg"], ["I worked at a quality pizzeria for years and I'm very picky about pizza.", 4, "pos"], ["Ultra thin crust \"pies\" served with a quickness and a big ol' attitude straight from Da Bronx.", 4, "pos"], ["Great food with quite amazing ambiance and lovely staff My favorite was fried beans and ice cream.", 4, "pos"], ["low cost and highly qualified wih best food and accomodation with good facilities are available and nice nature and good workersÂ  and all a", 5, "pos"], ["Great experience at this place  Service was out standing and the food was great.", 3, "neg"], ["Ambience- we chose to sit out and it was beautiful Lovely California sun under a beautiful patio of flowers   Food- Delicious.", 4, "pos"], ["Host would not make accommodations for disabled child.", 1, "neg"], ["This place has good and fresh seafood An excellent location with an ocean view.", 4, "pos"], ["Love the clam chowder and the fish tacos! The fish and chips are awesome too.", 4, "pos"], ["Ate at PT Loma seafood with my son Being from Washington we were not impressed with the fried cod.", 1, "neg"], ["On the water, watching the day boats return with tired but happy fishermen carrying their prized catches, as well as them collecting some of", 5, "pos"], ["Cheep beer and good chow! I had the crab meat sandwich It's expensive in my opinion, but went well with the Budweiser and fries.", 3, "neg"], ["Funny, I cant believe I didn't already review this place  It is really is a gem  We had 7 of us gathered to say goodbye to a colleague.", 4, "pos"], ["The venue was great, the biscuits were great and the service was okay.", 3, "neg"], ["Comfort food This is comfort food.", 3, "neg"], ["Great fresh Yummy Fresh.", 4, "pos"], ["Great Dinner and Evening We came here early with our party of 6 on a Saturday, and they accommodated us right away.", 5, "pos"], ["Incredibly fresh seafood done simply and done well! Large selection of fish types to choose from and served in multiple ways and multiple ma", 5, "pos"], ["The food was fantastic and so was the service   I recommend callng ahead if you don't want to wait.", 4, "pos"], ["Blue Water Seafood Market & Grill is located right off the 5 on India St near downtown San Diego.", 5, "pos"], ["My friend and I dined at the Blue Water Seafood with four other friends and we all enjoyed the experience.", 4, "pos"], ["We read reviews and wanted to see what the buzz was all about Arrived on a Sunday night at 7 pm to be greeted by a long line out the door.", 4, "pos"], ["This is a really cool place.", 3, "neg"], ["We went on a Sunday afternoon, about 3:30 pm, and we're not surprised that it was crowded.", 3, "neg"], ["Definitely not 25/2 people There were 5 of us and the total was 195 before tip  Not impressed overall The sushi was good.", 3, "neg"], ["it is a great place  food is amazing Specially lamb burger or turkey burger  i love it Iron omelet specially short rib is excellent.", 4, "pos"], ["This is the second time we've been to this location We love the view.", 3, "neg"], ["My friend and I shared the Mediterranean omelette and side of pancakes, it was perfect! My friend really liked the coffee too! The omelette ", 4, "pos"], ["OMG!  What a great choice for breakfast Came for the pancakes, but Iâ\u0080\u0099m lights were delicious as well.", 5, "pos"], ["The food was good but not worth a wait in line They hovered over us to take the order.", 2, "neg"], ["Delicious food, good size portions, reasonably priced, 5 star service and AMAZING coffee.", 5, "pos"], ["Excellent!Â  Worth the wait!Â  In our group we had the Baked Cinnamon Pancakes (almost custard like with a crisp cinnamon top ;)), the banan", 5, "pos"], ["Absolutely love this place! Great service (attentive without interrupting my meal every couple minutes) each time I go.", 5, "pos"], ["I've had to of been here 8 times now Bringing a total of 6 different groups of people to the best pizza ive ever had.", 5, "pos"], ["AMAZING Pizza!!! This restaurant is mid sized with both indoor and outdoor seating.", 5, "pos"], ["Been wanting to come here for a while I was surprised when we got a table immediately   Our server was very kind and very knowledgeable.", 4, "pos"], ["Great crust and sauce We ordered the spicy sausage and spinach pizza Big let down Almost no sausage at all on the entire pizza.", 3, "neg"], ["I get that the cultural atmosphere here is really appealing, but San Antonio has so much more to offer.", 1, "neg"], ["For a 24hr Mexican restaurant, this location is a GREAT family spot with fantastic service and most importantly EXCELLENT FOOD! A must if yo", 4, "pos"], ["I went here in the morning so I only had pastries but they were incredible!  The place was very busy with both restaurant and bakery traffic", 5, "pos"], ["We entered Saturday about 1PM The place was packed out Very popular with locals After about 30 minutes we were seated.", 4, "pos"], ["I didn't really understand all the hype for this place Pretty expensive, but not that impressive.", 3, "neg"], ["Mediocre food   Cochinita pibil was badly over-spiced.", 2, "neg"], ["Awesome pork tacos! Sorry no pics of the tacos they were gone instantlyð\u009f\u0099\u0082 Great beer as well I love the Riverwalk restaurants.", 4, "pos"], ["Crepas de Pato (crepes filled w/duck confit) were delicious.", 4, "pos"], ["You can make reservations here which is nice and it has a cool atmosphere as far as the river restaurants go.", 1, "neg"], ["One of the best meals of my life Everything was perfect from appetizer, to entree, to dessert! Our waiter was absolutely wonderful.", 5, "pos"], ["Here because their prickly pear Margarita rated top drink on the river walk; And I was not disappointed.", 5, "pos"], ["The food here was absolutely delicious If you're in San Antonio, you must eat on the River Walk It's just a must.", 5, "pos"], ["I was expecting better steak considering the packed crowds and reviews of this restaurant.", 3, "neg"], ["PEANUT ALLERGY SAFETY ALERT!!  Despite what the wait staff may tell you, the Toasted Nut Brittle Ice Cream does NOT just have pecans; it con", 1, "neg"], ["When of the best stakes I've tried Great service Very clean and tasty Has a great view on the river side Very unique inside.", 5, "pos"], ["Open community style seating with a VERY large burger for the price All burgers a made to order with pretty much any topping you want.", 3, "neg"], ["Visited Big'z many times, a great place for families because of their big outdoor play area.", 5, "pos"], ["It is OK Had a higher expectation I guess.", 3, "neg"], ["Bigz is a fun place, but keep expectation low for food preparation and service.", 1, "neg"], ["Bland I love the atmosphere but for being a burger joint, the burger were tasteless.", 3, "neg"], ["Great German food right off the river walk area  Went here for a break in eating Mexican while here for vacation.", 3, "neg"], ["Came here on a Sunday around 1:40, they were closing at 2:30 I have no complaints about the food it was really good.", 4, "pos"], ["Schilo's was a wonderful experience Authentic is a great word to use to describe both the decor and the menu.", 5, "pos"], ["Neat deli! We placed a large to go order for a meeting The food was ready when we arrived and all orders were correct.", 3, "neg"], ["This is as about as close as we come in San Antonio to a New York style deli.", 4, "pos"], ["Perfect ending to a perfect day The food was great and the wait staff is very mindful Bread is to die for.", 5, "pos"], ["Oh my good lord - the brunch here is amazing The service was a bit slow to start but he was friendly and everything was perfect.", 4, "pos"], ["Love the food  Fresh and hot   Service is outstanding, even the trainers.", 5, "pos"], ["No matter what city we are in across the country, this eatery is always one of our fail safe restaurants.", 4, "pos"], ["Father's Day lunch today, yes, it's the day before father's day, but who's complaining? I was treated to the Marcos meal for two along with ", 4, "pos"], ["Everything starting from the food ending with service was great) We both, I Â and my friend had a good time here.", 4, "pos"], ["Enjoyable fine dining experience The flavor profile for my dishes were designed to be complimented by a very extensive wine list.", 4, "pos"], ["Brought here for my birthday We valet parked for $12 This is your best option  We sat outside overlooking the river walk.", 4, "pos"], ["Second time back and not disappointed! The food is innovative and well balanced flavor and texture.", 5, "pos"], ["The Sticky Toffee Pudding has been one of the highlights of my San Antonio eating; the bar service was excellent, and the atmosphere was per", 5, "pos"], ["Finally make the trek over to the Far East Side just to try this famous place.", 2, "neg"], ["Nice place to have food with friends and family Taste-4/5 Value for money - 3.", 3, "neg"], ["We went here to try the HUGE pizza that we had seen advertised.", 4, "pos"], ["This pizza joint was a blast!!!  Lines wrapped around the building but does move quickly.", 5, "pos"], ["Ugh!  Someone has gotten a big head  Came in on a Wednesday for lunch Rudest staff person ever!  Wouldn't answer question.", 1, "neg"], ["Rosario's is not on the Riverwalk, but it IS absolutely crawling with locals, which is just one of the attributes recommending it for your v", 4, "pos"], ["Not super special, but solid Mexican food I got three enchiladas a la carte and the poblano pepper.", 4, "pos"], ["* GREAT FOOD * POOR SERVICE * DO YOU FEEL LUCKY ?????????? SERVICE IS ONE THING I LOOK FOR WHEN SPENDING MY MONEY.", 2, "neg"], ["Great authentic food! You can tell that this place is a local favorite .", 4, "pos"], ["After seeing all the Mexican restaurants in San Antonio I felt that I needed to make sure I chose the right place.", 4, "pos"], ["I have eaten at Pappadeaux a few times The food is excellent but the price is a little high Be ready to wait a long time.", 3, "neg"], ["Oyesters Baton Rouge were extremely delicious! Service was great and drinks were delightful.", 4, "pos"], ["Yummy !!! Pappadeaux is so good if you haven't been here you're missing out  The calamari, onion rings ,shrimp fondue .", 5, "pos"], ["Pappadeaux is a reason to visit Texas I cannot visit without eating at least one meal there.", 4, "pos"], ["Had a great first experience.", 5, "pos"], ["I love this place but the whole seating policy is ridiculous! I'm standing at the host stand talking to the hostess who just told us our tab", 5, "pos"], ["The service was excellent They kept the coffee coming.", 5, "pos"], ["One of my favorite places to eat and visit Service is always excellent Been a faithful customer for years now.", 5, "pos"], ["I have never had a much better breakfast every day You're going to wait for it, but it is well worth it.", 4, "pos"], ["Awesome food and awesome service Everything is deliciously made from scratch and served faster than you can finish your first drink.", 5, "pos"], ["Great place!!! Family oriented, not a over huge crowd so pick for lunch was speedy the food is delicious, I ordered the porky.", 4, "pos"], ["Really great burger, but a bit over-hyped The line was pretty ridiculous for a weeknight and patrons were fighting over seating.", 4, "pos"], ["This is absolutely the best burger in San Antonio   The burgers are HUGE  Great taste and messy, the way a burger should be.", 5, "pos"], ["This is one of my new favorite places The atmosphere is great Very laid back and open Awesome outdoor patio.", 4, "pos"], ["Great burgers, and a fun relaxed atmosphere.", 5, "pos"], ["Yes, yes, yes  Order the salsa, it wonâ\u0080\u0099t disappoint  I recently went vegan and was worried about what I could eat.", 4, "pos"], ["My friend suggested this place to me for my birthday lunch  I had never heard of \" the cove \".", 5, "pos"], ["Looooove the Cove! Locally sourced, gluten free friendly and so tasty.", 4, "pos"], ["Funky & eclectic Eaterythe fish tacos are great!  They could be largerbut combined with the honey mustard spinach salad.", 4, "pos"], ["All about the freshness at the Cove, veggies you eat tonight were in the garden yesterday.", 4, "pos"], ["Over priced and over hyped I've had better mexican food in Iowa It was INCREDIBLY bland and it made us quiet sad.", 2, "neg"], ["I have eaten here for years, unfortunately today was the last time.", 1, "neg"], ["Not sure the food at Paloma Blanca warrants the extended wait times and higher prices, but I don't have anything bad to say about this resta", 4, "pos"], ["I have eaten at Paloma Blanca two times before I think the decorations are acceptable and authentic.", 3, "neg"], ["Not the best Mexican food I've had, but good, not disappointing Upscale ambience and you pay a bit for it.", 4, "pos"], ["Food was good, server needed to ask if we had been there Tacos come dry and he should have asked if we wanted sauce etc.", 3, "neg"], ["Very impressed with this restaurant and will return Authentic place and the service didn't disappoint.", 5, "pos"], ["2-14-17Â  We're Home!Â  Parking right at the restaurant and facing the river.", 5, "pos"], ["SIDE ORDERS AND DRINKS, side order of beans and rice was excellent, but the chicken is extremely dry and the food seemed poorly cooked and l", 1, "neg"], ["Margaritasyum  The food is good, service was slow-ish.", 4, "pos"], ["Cool area of San Antonio recommended by a friend The pearl district a converted brewery with restaurants and shopping.", 5, "pos"], ["There are good places and there are great places This place is great Simply amazing from the decor to the friendly service.", 4, "pos"], ["Wonderful for Brunch! Today we visited Cured with some friends The brunch was for my birthday and we had a wonderful time.", 5, "pos"], ["Me and my co-workers really enjoyed this cool little place  The burgers tasted great, with not a lot of fuss on them.", 4, "pos"], ["Excellent ambiance and wait staff They were cognizant enough to allow me and my party to talk without pressuring us to order.", 4, "pos"], ["Everything is so spicy you can't taste the food/meat  Not my fave   The jalapeÃ±o sauce is great  This is not true Tex Mex to me.", 3, "neg"], ["Woah, it is truly said that Texas people have huge appetites I couldn't finish one full meal at Chuy's.", 5, "pos"], ["Very Disappointing!.", 4, "pos"], ["Great Place New one on iH-10 What's up with all the salt, couldn't eat the salsa Please I'm from Austin don't mess with the original.", 3, "neg"], ["This place is great! Try asking for a steak burrito with boom boom sauce you WON'T regret it! And also don't forget to ask for some creamy j", 2, "neg"], ["My favorite Mexican in San Antonio and that's saying a lot!! Can get really loud in the dimming rooms.", 4, "pos"], ["This place has some of the best margaritas and wonderful Mexican food.", 5, "pos"], ["We've eaten at La Fogata many times over the years when in SAÂ  Great food, great atmosphere, and far from the Riverwalk.", 4, "pos"], ["Very popular, busy restaurant If you're looking for Mexican food with atmosphere, this is it.", 4, "pos"], ["The Queso and chips Appetizer is $10!? The Fajitas were ok- â\u0080¦the Beef was good, the Chicken was dry.", 3, "neg"], ["This is one of my favorite Indian restaurants, the staff is friendly and the food is great! Upon my second time dining in my waiter was real", 4, "pos"], ["So much flavor and texture! It's hard to choose a favorite dish!  Salads were interesting, flatbread was hot and fresh and plentiful.", 4, "pos"], ["The Mediterranean food here is great Start with the pita bread and feta cheese.", 4, "pos"], ["Best Middle East food in San Antonio We found this place only be driving by.", 3, "neg"], ["Great Restaurant The service at Pasha sometimes leaves something to be desired but the food is amazing.", 4, "pos"], ["Best brunch ever! They always have an innovative menu, love the bakery! Bring the kids and the dog, but get there early because they do get ", 5, "pos"], ["Simple and easy Nice lunch mimosas and they serve pecan cranberry bread and seasonal pumpkin bread as signature items before meal orders.", 3, "neg"], ["Went to Bread Winners with the guys and I thought I'd give a review  Atmosphere, Design, & Service: 38/5.", 4, "pos"], ["The service, atmosphere, and ambiance are incredible Seriously one of my favorite restaurant environments ever.", 3, "neg"], ["This is a great place Packed in weekend I'm only giving a 4 star because they wouldn't keep their egg :).", 4, "pos"], ["I like this place I like the vibe of the area.", 4, "pos"], ["Nice atmosphere and good view from second floor Service was good Pizza was not.", 2, "neg"], ["We went to a birthday party at Eno's recently and had a blast The food was great and the so was the service.", 5, "pos"], ["I've been here once The service is non existent The pizzas were thin crust but way too thin for it.", 2, "neg"], ["I think this is a cool place and was excited to try out the thin crust Service is functional as another reviewer says.", 2, "neg"], ["In Dallas for the weekend and had to try some local BBQ, Pecan Lodge was a recommendation by a friend and it didnâ\u0080\u0099t disappoint.", 5, "pos"], ["The best brisket, sausage and ribs you can sit down and feast on! And sit you will want either indoors or on outdoor patio after quite an in", 4, "pos"], ["All hype We came to Dallas for a swim meet and had heard so much about this place.", 2, "neg"], ["Wanted to try Pecan Lodge a second time on a calmer day before I gave a detailed review  Atmosphere, Design, & Service: 40/5.", 4, "pos"], ["Love everything this place has going on.", 5, "pos"], ["Enjoyed some delicious food from Chuy's whilst visiting Dallas.", 4, "pos"], ["Visiting Dallas for the third trip, this time in Dallas (as opposed to Plano) and looked for and found the nearest Chuy's.", 4, "pos"], ["We enjoyed our visit to Chuy's Getting nearby parking can be challenging but we were lucky to get a spot close by.", 4, "pos"], ["Free queso is my jam and this place has it! Â Their happy hour specials, which include a free queso bar, can't be beat.", 3, "neg"], ["No Just no i will never again torture myself No We went back one other time and it was almost as painful as the first.", 1, "neg"], ["I have dined here over a 30 year period on a regular basis.", 2, "neg"], ["Excellant oysters, delicious bread, great service Pricy, noisey, Vast menu with wonderful selections.", 3, "neg"], ["Went with three of our grandsons so we all ordered different appetizers and entrees so that we could have a smorgasbord tasting all the diff", 4, "pos"], ["Really enjoy this place! Everything from the food to the staff was fantastic.", 4, "pos"], ["Pappadeaux is a favorite for business lunch and dinner celebrations.", 4, "pos"], ["This has been my favorite breakfast and occasional lunch and dinner place since I was introduced to it a few months ago.", 4, "pos"], ["The selection is great , food is always fresh and tasty , ready to eat or freshly made while you wait , service is great and tasters always ", 4, "pos"], ["If you want to enjoy a tasty meal, don't go anywhere just visit Eatzi's They Provide awesome services to their customers.", 5, "pos"], ["I like the feel of this place, the casualness.", 4, "pos"], ["Great breakfast and fast service, good value.", 3, "neg"], ["This is not Tex-Mex, but true cuisine of Mexico City The food is absolutely delicious, and I have tried almost everything on the menu.", 4, "pos"], ["Smoked Chicken Nachos.", 4, "pos"], ["Just okay - I thought both chicken dishes were adequate, the margaritas helped.", 3, "neg"], ["The worst was the service!!! Waited for 40minutes to get a table and the food was not good!! Please people don't waste your money in this re", 2, "neg"], ["As always one of my favorites As a dallas native i have been eating at javiers for 30+ years I always enjoy my time there.", 4, "pos"], ["Ordered food here for take out once so I havenâ\u0080\u0099t really experienced dining in.", 4, "pos"], ["I got the Western burger, onion strings, root beer and toasted marshmallow snore shake.", 4, "pos"], ["This is the perfect place to have a tasty meal Burgers and potato chips are very fresh and delicious.", 5, "pos"], ["This is the best place for fresh take Hamburgers Their potato chips and hamburger were really delicious.", 4, "pos"], ["I'm a fan - some of my faves:  Build your own french fries - what's there not to like? Enough said burger - the potato chips are key as they", 4, "pos"], ["Love this place!  Went for Sunday brunch and ate at the bar.", 4, "pos"], ["Bottom line: ========= Good comfort food, but highly priced.", 3, "neg"], ["First of all, we loved the dark atmosphere with the stained glass rock and roll windows.", 4, "pos"], ["Aside from Max's Wine Dive, this is my absolute favourite bar in Dallas that I've found so far.", 5, "pos"], ["I went here with a business group The beer, wine, and cocktail selection was great! I had the spiked sangria and it was delicious.", 4, "pos"], ["The Hillstone in University Park is one of our favorite Dallas restaurants.", 4, "pos"], ["Very Fast service and food is very tasty I like this restaurant very much Â Staff is very professional.", 5, "pos"], ["Snotty and unprofessional waitstaff and bartender.", 1, "neg"], ["Roasted Prime Rib.", 2, "neg"], ["First visit, high expectations from word of mouth.", 2, "neg"], ["My friend and I eat here every time we are in the area.", 4, "pos"], ["Great place for a Sunday brunch Expect a long wait and if the weather is good sit on the patio.", 4, "pos"], ["This is our second restaurant to try in the Bishop Arts District.", 4, "pos"], ["Great service and great food This has turned into one of our favorite restaurants in the neighborhood.", 4, "pos"], ["3 mos since my last visit, 5 more people at our table, 5 completely different orders and WE ALL LOVED IT! Additionally we all ordered from t", 5, "pos"], ["I am not really a Thai lover, but I still wanted to give it a try because of my friends.", 3, "neg"], ["I used to love this place especially their steamed sea bass with bok Choy Used to be delicious and still seem healthy.", 3, "neg"], ["Asian Mint Fusion restaurant in North Dallas with some awesome awesome vegetarian options.", 4, "pos"], ["Oriental restaurants seemed to be quite rare in Dallas, at least near my neighbourhood.", 4, "pos"], ["Hands down the best Thai restaurant in North Dallas It has more of a modern touch to ambience and food.", 5, "pos"], ["Excellent brunch spot! Probably excellent everything! The pimento cheese reminded me of the best homemade from my youth.", 5, "pos"], ["Nice place to come eat lunch if you're in central dallas The server was very attentive - a bit too attentive.", 4, "pos"], ["Great patioumm sorry porch Good place to people watch Drinks are decent too but the food could be a lot better.", 3, "neg"], ["Nice atmosphere--busy but not too loud Had the pimento cheese appetizer Has a nice kick to it Hanger steak with garlic mash--excellent.", 4, "pos"], ["Went here for a quick lunch one day.", 4, "pos"], ["We mostly do breakfast here and everything done with highest level of integrity! The deserts are to die for here as well.", 4, "pos"], ["First time for dinner at Hattie's was an indulgence in southern hospitality and food.", 4, "pos"], ["A wonderful Sunday Brunch in the Bishop Arts District Make sure you make a reservation.", 4, "pos"], ["Their pecan crusted catfish is to die for, and well worth the trek over to Oak Cliff if you live in the North Dallas area.", 4, "pos"], ["There are very few places we've been that I cannot find something to nitpick Hattie's is one of those places.", 5, "pos"], ["We visited Pappas Bros Steakhouse last weekend for a birthday dinner, great atmosphere.", 4, "pos"], ["Steak was one of the best I ever had Sides are extra Had mushrooms and cauliflower Both just as excellent as the steak.", 4, "pos"], ["Excellent steak, so Devine it melts in your mouth You should try the mac'n cheese with crab.", 4, "pos"], ["Consistently good steak Probably my go to place for steak in Dallas The wine list is lengthy and there is a sommelier to help.", 4, "pos"], ["In Dallas area for business This restaurant is located in a restaurant business park area.", 4, "pos"], ["A solid mediocre restaurant The pasta sampler was tasty, but the large dinner salad was soggy Very kid friendly.", 3, "neg"], ["Delicious and Friendly they makes the best fried chicken in the city you get a warm feeling when you walk in nonetheless.", 4, "pos"], ["It's fun to be in a place with so much history, so much family.", 2, "neg"], ["Woof.", 4, "pos"], ["If there was a mark for lower than one they would definitely have that.", 1, "neg"], ["Our favorite special occasion destination for gastronomical delights! Mr Al offers some of the finest cuts prepared flawlessly and offered u", 4, "pos"], ["We were greeted at the door and seated promptly at 7:00.", 4, "pos"], ["WOW! Went there for Mother's Day Brunch ! Was awesome what a menu they put out for that special day! Loved It!! The service outstanding, Kep", 4, "pos"], ["The service is impeccable & the staff was warm and welcoming.", 5, "pos"], ["I just got done having the most amazing experience at Al Biernat's.", 5, "pos"], ["Tacos are like nothing I have ever experienced! It's a gourmet meal in a tortilla! The flavors pop in your mouth.", 4, "pos"], ["Went on a Sunday afternoon at about 2:30 Parking was a huge challenge.", 4, "pos"], ["Tried all the three vegetarian taco options.", 4, "pos"], ["Never disappointed Not your average taco Gourmet Haven't found one I dislike yet The Mexican \"rotisserie corn (elote)\" is amazing.", 5, "pos"], ["Tacos are my favorite that too after a long day and a hard party night out in downtown Dallas this is a place you never wanna miss , the ban", 5, "pos"], ["Today I met some friends for lunch as I get ready to move out of Dallas! Rise was where I chose to have my last lunch with some very close f", 4, "pos"], ["Absolutely must try if you are in Dallas area The former president GW Bush I'm told likes the place.", 4, "pos"], ["C'est magnifique!  The food, the atmosphere, the service, it's all wonderful.", 5, "pos"], ["I wasn't sure what to expect with Risebut my meal (from starter to finish) was sheer perfection.", 4, "pos"], ["I went to Rise with a friend for the first time earlier this month and I'm surprised I haven't been sooner.", 4, "pos"], ["Enjoyed a nice dinner here while visiting family in Dallas We started with lots of chips, salsa, and guacamole.", 4, "pos"], ["I got the Quesadilla and it was yummy The service was wonderful and I want to try everything on the menu.", 4, "pos"], ["Our 1st time in and it was great! The family atmosphere made us feel right at home.", 4, "pos"], ["Best hidden Mexican food restaurant, I love going here! The salsa is on point and the skinny margaritas will knock you on your ass they are ", 5, "pos"], ["Great lunch spot! Quick and good food! Got the lunch enchiladas - compared to a lot of tex-mex I've been trying lately, clearly one of the b", 4, "pos"], ["Good food! I like the pizza.", 5, "pos"]]